{"text": "Title: CARTIER: Cartographic lAnguage Reasoning Targeted at Instruction Execution for Robots\nAbstract: This work explores the capacity of large language models (LLMs) to address problems at the intersection of spatial planning and natural language interfaces for navigation. We focus on following complex instructions that are more akin to natural conversation than traditional explicit procedural directives typically seen in robotics. Unlike most prior work where navigation directives are provided as simple imperative commands (e.g., \"go to the fridge\"), we examine implicit directives obtained through conversational interactions.We leverage the 3D simulator AI2Thor to create household query scenarios at scale, and augment it by adding complex language queries for 40 object types. We demonstrate that a robot using our method CARTIER (Cartographic lAnguage Reasoning Targeted at Instruction Execution for Robots) can parse descriptive language queries up to 42% more reliably than existing LLM-enabled methods by exploiting the ability of LLMs to interpret the user interaction in the context of the objects in the scenario.", "field": "cs", "label": 1}
{"text": "Title: SugarViT -- Multi-objective Regression of UAV Images with Vision Transformers and Deep Label Distribution Learning Demonstrated on Disease Severity Prediction in Sugar Beet\nAbstract: Remote sensing and artificial intelligence are pivotal technologies of precision agriculture nowadays. The efficient retrieval of large-scale field imagery combined with machine learning techniques shows success in various tasks like phenotyping, weeding, cropping, and disease control. This work will introduce a machine learning framework for automatized large-scale plant-specific trait annotation for the use case disease severity scoring for Cercospora Leaf Spot (CLS) in sugar beet. With concepts of Deep Label Distribution Learning (DLDL), special loss functions, and a tailored model architecture, we develop an efficient Vision Transformer based model for disease severity scoring called SugarViT. One novelty in this work is the combination of remote sensing data with environmental parameters of the experimental sites for disease severity prediction. Although the model is evaluated on this special use case, it is held as generic as possible to also be applicable to various image-based classification and regression tasks. With our framework, it is even possible to learn models on multi-objective problems as we show by a pretraining on environmental metadata.", "field": "cs", "label": 1}
{"text": "Title: Instruction Makes a Difference\nAbstract: We introduce Instruction Document Visual Question Answering (iDocVQA) dataset and Large Language Document (LLaDoc) model, for training Language-Vision (LV) models for document analysis and predictions on document images, respectively. Usually, deep neural networks for the DocVQA task are trained on datasets lacking instructions. We show that using instruction-following datasets improves performance. We compare performance across document-related datasets using the recent state-of-the-art (SotA) Large Language and Vision Assistant (LLaVA)1.5 as the base model. We also evaluate the performance of the derived models for object hallucination using the Polling-based Object Probing Evaluation (POPE) dataset. The results show that instruction-tuning performance ranges from 11X to 32X of zero-shot performance and from 0.1% to 4.2% over non-instruction (traditional task) finetuning. Despite the gains, these still fall short of human performance (94.36%), implying there's much room for improvement.", "field": "cs", "label": 0}
{"text": "Title: Multi-scale Traffic Pattern Bank for Cross-city Few-shot Traffic Forecasting\nAbstract: Traffic forecasting is crucial for intelligent transportation systems (ITS), aiding in efficient resource allocation and effective traffic control. However, its effectiveness often relies heavily on abundant traffic data, while many cities lack sufficient data due to limited device support, posing a significant challenge for traffic forecasting. Recognizing this challenge, we have made a noteworthy observation: traffic patterns exhibit similarities across diverse cities. Building on this key insight, we propose a solution for the cross-city few-shot traffic forecasting problem called Multi-scale Traffic Pattern Bank (MTPB). Primarily, MTPB initiates its learning process by leveraging data-rich source cities, effectively acquiring comprehensive traffic knowledge through a spatial-temporal-aware pre-training process. Subsequently, the framework employs advanced clustering techniques to systematically generate a multi-scale traffic pattern bank derived from the learned knowledge. Next, the traffic data of the data-scarce target city could query the traffic pattern bank, facilitating the aggregation of meta-knowledge. This meta-knowledge, in turn, assumes a pivotal role as a robust guide in subsequent processes involving graph reconstruction and forecasting. Empirical assessments conducted on real-world traffic datasets affirm the superior performance of MTPB, surpassing existing methods across various categories and exhibiting numerous attributes conducive to the advancement of cross-city few-shot forecasting methodologies. The code is available in https://github.com/zhyliu00/MTPB.", "field": "cs", "label": 0}
{"text": "Title: Polynomiality of the double ramification cycle\nAbstract: Let $A = (a_1,\\dots,a_n)\\in \\mathbb{Z}^n$ be a sequence with sum $k(2g-2+n)$. The double ramification cycle $\\mathsf{DR}_g(A) \\in \\mathsf{CH}^g(\\bar{\\mathcal{M}}_{g,n})$ is the virtual class of the locus of curves $(C,p_1,\\dots,p_n)$ where the line bundle $(\\omega_C^{\\log})^{-k}\\left(\\sum a_i p_i\\right)$ is trivial. Although there has long been a formula for $\\mathsf{DR}_g(A)$ [JPPZ17], the exact dependence on $A$ was unknown for a long time, though it was conjectured to be polynomial in $A$. A proof was announced in [JPPZ17], and Pixton gave a proof incorporating ideas of Zagier in [Pix23]. Here we present an alternative proof of the polynomiality of the double ramification cycle.", "field": "math", "label": 0}
{"text": "Title: AoII-Optimum Sampling of CTMC Information Sources Under Sampling Rate Constraints\nAbstract: We consider a sensor that samples an $N$-state continuous-time Markov chain (CTMC)-based information source process, and transmits the observed state of the source, to a remote monitor tasked with timely tracking of the source process. The mismatch between the source and monitor processes is quantified by age of incorrect information (AoII), which penalizes the mismatch as it stays longer, and our objective is to minimize the average AoII under an average sampling rate constraint. We assume a perfect reverse channel and hence the sensor has information of the estimate while initiating a transmission or preempting an ongoing transmission. First, by modeling the problem as an average cost constrained semi-Markov decision process (CSMDP), we show that the structure of the problem gives rise to an optimum threshold policy for which the sensor initiates a transmission once the AoII exceeds a threshold depending on the instantaneous values of both the source and monitor processes. However, due to the high complexity of obtaining the optimum policy in this general setting, we consider a relaxed problem where the thresholds are allowed to be dependent only on the estimate. We show that this relaxed problem can be solved with a novel CSMDP formulation based on the theory of absorbing MCs, with a computational complexity of $\\mathcal{O}(N^4)$, allowing one to obtain optimum policies for general CTMCs with over a hundred states.", "field": "cs", "label": 1}
{"text": "Title: Distribution of neighboring values of the Liouville and Möbius functions\nAbstract: Let $\\lambda(n)$ and $\\mu(n)$ denote the Liouville function and the M\\\"obius function, respectively. In this study, relationships between the values of $\\lambda(n)$ and $\\lambda(n+h)$ up to $n\\leq10^8$ for $1\\leq h\\leq1,000$ are explored. Chowla's conjecture predicts that the conditional expectation of $\\lambda(n+h)$ given $\\lambda(n)=1$ for $1\\leq n\\leq X$ converges to the conditional expectation of $\\lambda(n+h)$ given $\\lambda(n)=-1$ for $1\\leq n\\leq X$ as $X\\rightarrow\\infty$. However, for finite $X$, these conditional expectations are different. The observed difference, together with the significant difference in $\\chi^2$ tests of independence, reveals hidden additive properties among the values of the Liouville function. Similarly, such additive structures for $\\mu(n)$ for square-free $n$'s are identified. These findings pave the way for developing possible, and hopefully efficient, additive algorithms for these functions. The potential existence of fast, additive algorithms for $\\lambda(n)$ and $\\mu(n)$ may eventually provide scientific evidence supporting the belief that prime factorization of large integers should not be too difficult. For $1\\leq h\\leq1,000$, the study also tested the convergence speeds of Chowla's conjecture and found no relation on $h$.", "field": "math", "label": 1}
{"text": "Title: Polydifferential Lie bialgebras and graph complexes\nAbstract: We study the deformation complex of a canonical morphism $i$ from the properad of (degree shifted) Lie bialgebras $\\mathbf{Lieb}_{c,d}$ to its polydifferential version $\\mathcal{D}(\\mathbf{Lieb}_{c,d})$ and show that it is quasi-isomorphic to the oriented graph complex $\\mathbf{GC}^{\\text{or}}_{c+d+1}$, up to one rescaling class. As the latter complex is quasi-isomorphic to the original graph complex $\\mathbf{GC}_{c+d}$, we conclude that the space of homotopy non-trivial infinitesimal deformations of the canonical map $i$ can be identified with the Grothendieck-Teichm\\\"uller Lie algebra $\\mathfrak{grt}$; moreover, every such an infinitesimal deformation extends to a genuine deformation of the canonical morphism $i$ from $\\mathbf{Lieb}_{c,d}$ to $\\mathcal{D}(\\mathbf{Lieb}_{c,d})$. The full deformation complex is described with the help of a new graph complex of so called entangled graphs, whose suitable quotient complex is shown to contain the tensor product $H(\\mathbf{GC}_c) \\otimes H(\\mathbf{GC}_d)$ of cohomologies of Kontsevich graph complexes $\\mathbf{GC}_c \\otimes \\mathbf{GC}_d$.", "field": "math", "label": 1}
{"text": "Title: Meta Prompting for AGI Systems\nAbstract: This paper presents a comprehensive study of Meta Prompting, an innovative technique reshaping the utilization of large language models (LLMs), multi-modal foundation models, and AI systems in problem-solving and data interaction. Grounded in type theory and category theory, Meta Prompting emphasizes the structure and syntax of information over traditional content-centric methods. The paper explores the formal definitions of Meta Prompting (MP), sets it apart from Few-Shot Prompting, and underlines its effectiveness in various AI applications. A key focus is applying Meta Prompting for complex reasoning (MP-CR) tasks, showing how it effectively deconstructs intricate problems into simpler sub-problems, enhancing token efficiency, and enabling more equitable problem-solving comparisons, especially against few-shot prompting methods. Additionally, the paper introduces Meta Prompting for prompting tasks, allowing LLMs to self-generate new prompts in a recursive, metaprogramming-like manner. This approach marks a significant leap in AI's autonomous and adaptive capabilities. The paper also introduces the integration of Meta Prompting into multi-modal foundation model settings, tackling the challenges and opportunities of incorporating varied data types such as images, audio, and video within the structured Meta Prompting framework. Empirical experiments, including solving the Game of 24 tasks with 100% success rate, demonstrate the MP-CR Agent's enhanced reasoning capabilities, achieving high accuracy and efficiency, and showcasing Meta Prompting's transformative impact on AI problem-solving. (The code is available at https://github.com/meta-prompting/meta-prompting)", "field": "cs", "label": 0}
{"text": "Title: Machine Unlearning for Image-to-Image Generative Models\nAbstract: Machine unlearning has emerged as a new paradigm to deliberately forget data samples from a given model in order to adhere to stringent regulations. However, existing machine unlearning methods have been primarily focused on classification models, leaving the landscape of unlearning for generative models relatively unexplored. This paper serves as a bridge, addressing the gap by providing a unifying framework of machine unlearning for image-to-image generative models. Within this framework, we propose a computationally-efficient algorithm, underpinned by rigorous theoretical analysis, that demonstrates negligible performance degradation on the retain samples, while effectively removing the information from the forget samples. Empirical studies on two large-scale datasets, ImageNet-1K and Places-365, further show that our algorithm does not rely on the availability of the retain samples, which further complies with data retention policy. To our best knowledge, this work is the first that represents systemic, theoretical, empirical explorations of machine unlearning specifically tailored for image-to-image generative models. Our code is available at https://github.com/jpmorganchase/l2l-generator-unlearning.", "field": "cs", "label": 1}
{"text": "Title: Benefits of Transformer: In-Context Learning in Linear Regression Tasks with Unstructured Data\nAbstract: In practice, it is observed that transformer-based models can learn concepts in context in the inference stage. While existing literature, e.g., \\citet{zhang2023trained,huang2023context}, provide theoretical explanations on this in-context learning ability, they assume the input $x_i$ and the output $y_i$ for each sample are embedded in the same token (i.e., structured data). However, in reality, they are presented in two tokens (i.e., unstructured data \\cite{wibisono2023role}). In this case, this paper conducts experiments in linear regression tasks to study the benefits of the architecture of transformers and provides some corresponding theoretical intuitions to explain why the transformer can learn from unstructured data. We study the exact components in a transformer that facilitate the in-context learning. In particular, we observe that (1) a transformer with two layers of softmax (self-)attentions with look-ahead attention mask can learn from the prompt if $y_i$ is in the token next to $x_i$ for each example; (2) positional encoding can further improve the performance; and (3) multi-head attention with a high input embedding dimension has a better prediction performance than single-head attention.", "field": "cs", "label": 1}
{"text": "Title: Algebraic Complexity and Neurovariety of Linear Convolutional Networks\nAbstract: In this paper, we study linear convolutional networks with one-dimensional filters and arbitrary strides. The neuromanifold of such a network is a semialgebraic set, represented by a space of polynomials admitting specific factorizations. Introducing a recursive algorithm, we generate polynomial equations whose common zero locus corresponds to the Zariski closure of the corresponding neuromanifold. Furthermore, we explore the algebraic complexity of training these networks employing tools from metric algebraic geometry. Our findings reveal that the number of all complex critical points in the optimization of such a network is equal to the generic Euclidean distance degree of a Segre variety. Notably, this count significantly surpasses the number of critical points encountered in the training of a fully connected linear network with the same number of parameters.", "field": "math", "label": 0}
{"text": "Title: Evolutionary Tabletop Game Design: A Case Study in the Risk Game\nAbstract: Creating and evaluating games manually is an arduous and laborious task. Procedural content generation can aid by creating game artifacts, but usually not an entire game. Evolutionary game design, which combines evolutionary algorithms with automated playtesting, has been used to create novel board games with simple equipment; however, the original approach does not include complex tabletop games with dice, cards, and maps. This work proposes an extension of the approach for tabletop games, evaluating the process by generating variants of Risk, a military strategy game where players must conquer map territories to win. We achieved this using a genetic algorithm to evolve the chosen parameters, as well as a rules-based agent to test the games and a variety of quality criteria to evaluate the new variations generated. Our results show the creation of new variations of the original game with smaller maps, resulting in shorter matches. Also, the variants produce more balanced matches, maintaining the usual drama. We also identified limitations in the process, where, in many cases, where the objective function was correctly pursued, but the generated games were nearly trivial. This work paves the way towards promising research regarding the use of evolutionary game design beyond classic board games.", "field": "cs", "label": 0}
{"text": "Title: Generalised triple homomorphisms and Derivations\nAbstract: We introduce generalised triple homomorphism between Jordan Banach triple systems as a concept which extends the notion of generalised homomorphism between Banach algebras given by Jarosz and Johnson in 1985 and 1987, respectively. We prove that every generalised triple homomorphism between JB$^*$-triples is automatically continuous. When particularised to C$^*$-algebras, we rediscover one of the main theorems established by Johnson. We shall also consider generalised triple derivations from a Jordan Banach triple $E$ into a Jordan Banach triple $E$-module, proving that every generalised triple derivation from a JB$^*$-triple $E$ into $E^*$ is automatically continuous.", "field": "math", "label": 1}
{"text": "Title: Not All Learnable Distribution Classes are Privately Learnable\nAbstract: We give an example of a class of distributions that is learnable in total variation distance with a finite number of samples, but not learnable under $(\\varepsilon, \\delta)$-differential privacy. This refutes a conjecture of Ashtiani.", "field": "cs", "label": 1}
{"text": "Title: Time-uniform log-Sobolev inequalities and applications to propagation of chaos\nAbstract: Time-uniform log-Sobolev inequalities (LSI) satisfied by solutions of semi-linear mean-field equations have recently appeared to be a key tool to obtain time-uniform propagation of chaos estimates. This work addresses the more general settings of time-inhomogeneous Fokker-Planck equations. Time-uniform LSI are obtained in two cases, either with the bounded-Lipschitz perturbation argument with respect to a reference measure, or with a coupling approach at high temperature. These arguments are then applied to mean-field equations, where, on the one hand, sharp marginal propagation of chaos estimates are obtained in smooth cases and, on the other hand, time-uniform global propagation of chaos is shown in the case of vortex interactions with quadratic confinement potential on the whole space. In this second case, an important point is to establish global gradient and Hessian estimates, which is of independent interest. We prove these bounds in the more general situation of non-attractive logarithmic and Riesz singular interactions.", "field": "math", "label": 0}
{"text": "Title: ALISON: Fast and Effective Stylometric Authorship Obfuscation\nAbstract: Authorship Attribution (AA) and Authorship Obfuscation (AO) are two competing tasks of increasing importance in privacy research. Modern AA leverages an author's consistent writing style to match a text to its author using an AA classifier. AO is the corresponding adversarial task, aiming to modify a text in such a way that its semantics are preserved, yet an AA model cannot correctly infer its authorship. To address privacy concerns raised by state-of-the-art (SOTA) AA methods, new AO methods have been proposed but remain largely impractical to use due to their prohibitively slow training and obfuscation speed, often taking hours. To this challenge, we propose a practical AO method, ALISON, that (1) dramatically reduces training/obfuscation time, demonstrating more than 10x faster obfuscation than SOTA AO methods, (2) achieves better obfuscation success through attacking three transformer-based AA methods on two benchmark datasets, typically performing 15% better than competing methods, (3) does not require direct signals from a target AA classifier during obfuscation, and (4) utilizes unique stylometric features, allowing sound model interpretation for explainable obfuscation. We also demonstrate that ALISON can effectively prevent four SOTA AA methods from accurately determining the authorship of ChatGPT-generated texts, all while minimally changing the original text semantics. To ensure the reproducibility of our findings, our code and data are available at: https://github.com/EricX003/ALISON.", "field": "cs", "label": 0}
{"text": "Title: Control-Theoretic Techniques for Online Adaptation of Deep Neural Networks in Dynamical Systems\nAbstract: Deep neural networks (DNNs), trained with gradient-based optimization and backpropagation, are currently the primary tool in modern artificial intelligence, machine learning, and data science. In many applications, DNNs are trained offline, through supervised learning or reinforcement learning, and deployed online for inference. However, training DNNs with standard backpropagation and gradient-based optimization gives no intrinsic performance guarantees or bounds on the DNN, which is essential for applications such as controls. Additionally, many offline-training and online-inference problems, such as sim2real transfer of reinforcement learning policies, experience domain shift from the training distribution to the real-world distribution. To address these stability and transfer learning issues, we propose using techniques from control theory to update DNN parameters online. We formulate the fully-connected feedforward DNN as a continuous-time dynamical system, and we propose novel last-layer update laws that guarantee desirable error convergence under various conditions on the time derivative of the DNN input vector. We further show that training the DNN under spectral normalization controls the upper bound of the error trajectories of the online DNN predictions, which is desirable when numerically differentiated quantities or noisy state measurements are input to the DNN. The proposed online DNN adaptation laws are validated in simulation to learn the dynamics of the Van der Pol system under domain shift, where parameters are varied in inference from the training dataset. The simulations demonstrate the effectiveness of using control-theoretic techniques to derive performance improvements and guarantees in DNN-based learning systems.", "field": "cs", "label": 1}
{"text": "Title: A bialgebra theory of Gel'fand-Dorfman algebras with applications to Lie conformal bialgebras\nAbstract: Gel'fand-Dorfman algebras (GD algebras) give a natural construction of Lie conformal algebras and are in turn characterized by this construction. In this paper, we define the Gel'fand-Dorfman bialgebra (GD bialgebras) and enrich the above construction to a construction of Lie conformal bialgebras by GD bialgebras. As a special case, Novikov bialgebras yield Lie conformal bialgebras. We further introduce the notion of the Gel'fand-Dorfman Yang-Baxter equation (GDYBE), whose skew-symmetric solutions produce GD bialgebras. Moreover, the notions of $\\mathcal{O}$-operators on GD algebras and pre-Gel'fand-Dorfman algebras (pre-GD algebras) are introduced to provide skew-symmetric solutions of the GDYBE. The relationships between these notions for GD algebras and the corresponding ones for Lie conformal algebras are given. In particular, there is a natural construction of Lie conformal bialgebras from pre-GD algebras. Finally, GD bialgebras are characterized by certain matched pairs and Manin triples of GD algebras.", "field": "math", "label": 1}
{"text": "Title: Absence of shift-invariant Gibbs states (delocalisation) for one-dimensional $\\mathbb Z$-valued fields with Long-Range interactions\nAbstract: We show that a modification of the proof of our paper [CvELNR18], in the spirit of [FP81], shows delocalisation in the long-range Discrete Gaussian Chain, and generalisations thereof, for any decay power $\\alpha>2$ and at all temperatures. The argument proceeds by contradiction: any shift-invariant and localised measure (in the $L^1$ sense), is a convex combination of ergodic localised measures. But the latter cannot exist: on one hand, by the ergodic theorem, the average of the field over growing boxes would be almost surely bounded ; on the other hand the measure would be absolutely continuous with respect to its height-shifted translates, as a simple relative entropy computation shows. This leads to a contradiction and answers, in a non-quantitative way, an open question stated in a recent paper [G23] of C.Garban.", "field": "math", "label": 0}
{"text": "Title: Dependency-Aware Online Caching\nAbstract: We consider a variant of the online caching problem where the items exhibit dependencies among each other: an item can reside in the cache only if all its dependent items are also in the cache. The dependency relations can form any directed acyclic graph. These requirements arise e.g., in systems such as CacheFlow (SOSR 2016) that cache forwarding rules for packet classification in IP-based communication networks. First, we present an optimal randomized online caching algorithm which accounts for dependencies among the items. Our randomized algorithm is $O( \\log k)$-competitive, where $k$ is the size of the cache, meaning that our algorithm never incurs the cost of $O(\\log k)$ times higher than even an optimal algorithm that knows the future input sequence. Second, we consider the bypassing model, where requests can be served at a fixed price without fetching the item and its dependencies into the cache -- a variant of caching with dependencies introduced by Bienkowski et al. at SPAA 2017. For this setting, we give an $O( \\sqrt{k \\cdot \\log k})$-competitive algorithm, which significantly improves the best known competitiveness. We conduct a small case study, to find out that our algorithm incurs on average 2x lower cost.", "field": "cs", "label": 1}
{"text": "Title: Convergence rates for the moment-SoS hierarchy\nAbstract: We introduce a comprehensive framework for analyzing convergence rates for infinite dimensional linear programming problems (LPs) within the context of the moment-sum-of-squares hierarchy. Our primary focus is on extending the existing convergence rate analysis, initially developed for static polynomial optimization, to the more general and challenging domain of the generalized moment problem. We establish an easy-to-follow procedure for obtaining convergence rates. Our methodology is based on, firstly, a state-of-the-art degree bound for Putinar's Positivstellensatz, secondly, quantitative polynomial approximation bounds, and, thirdly, a geometric Slater condition on the infinite dimensional LP. We address a broad problem formulation that encompasses various applications, such as optimal control, volume computation, and exit location of stochastic processes. We illustrate the procedure at these three problems and, using a recent improvement on effective versions of Putinar's Positivstellensatz, we improve existing convergence rates.", "field": "math", "label": 0}
{"text": "Title: On Maximum Chains in the Bruhat Order of A(n,2)\nAbstract: Let $\\mathcal{A}(R,S)$ denote the class of all matrices of zeros and ones with row sum vector $R$ and column sum vector~$S$. We introduce the notion of an inversion in a $(0,1)$--matrix. This definition extends the standard notion of an inversion of a permutation, in the sense that both notions agree on the class of permutation matrices. We prove that the number of inversions in a $(0,1)$--matrix is monotonic with respect to the secondary Bruhat order of the class $\\mathcal{A}(R,S)$. We apply this result in establishing the maximum length of a chain in the Bruhat order of the class $\\mathcal{A}(n,2)$ of $(0,1)$--matrices of order $n$ in which every row and every column has a sum of~$2$. We give algorithmic constructions of chains of maximum length in the Bruhat order of $\\mathcal{A}(n,2)$.", "field": "math", "label": 1}
{"text": "Title: Vertical Symbolic Regression via Deep Policy Gradient\nAbstract: Vertical Symbolic Regression (VSR) recently has been proposed to expedite the discovery of symbolic equations with many independent variables from experimental data. VSR reduces the search spaces following the vertical discovery path by building from reduced-form equations involving a subset of independent variables to full-fledged ones. Proved successful by many symbolic regressors, deep neural networks are expected to further scale up VSR. Nevertheless, directly combining VSR with deep neural networks will result in difficulty in passing gradients and other engineering issues. We propose Vertical Symbolic Regression using Deep Policy Gradient (VSR-DPG) and demonstrate that VSR-DPG can recover ground-truth equations involving multiple input variables, significantly beyond both deep reinforcement learning-based approaches and previous VSR variants. Our VSR-DPG models symbolic regression as a sequential decision-making process, in which equations are built from repeated applications of grammar rules. The integrated deep model is trained to maximize a policy gradient objective. Experimental results demonstrate that our VSR-DPG significantly outperforms popular baselines in identifying both algebraic equations and ordinary differential equations on a series of benchmarks.", "field": "cs", "label": 0}
{"text": "Title: A rigorous integrator and global existence for higher-dimensional semilinear parabolic PDEs via semigroup theory\nAbstract: In this paper, we introduce a general constructive method to compute solutions of initial value problems of semilinear parabolic partial differential equations via semigroup theory and computer-assisted proofs. Once a numerical candidate for the solution is obtained via a finite dimensional projection, Chebyshev series expansions are used to solve the linearized equations about the approximation from which a solution map operator is constructed. Using the solution operator (which exists from semigroup theory), we define an infinite dimensional contraction operator whose unique fixed point together with its rigorous bounds provide the local inclusion of the solution. Applying this technique for multiple time steps leads to constructive proofs of existence of solutions over long time intervals. As applications, we study the 3D/2D Swift-Hohenberg, where we combine our method with explicit constructions of trapping regions to prove global existence of solutions of initial value problems converging asymptotically to nontrivial equilibria. A second application consists of the 2D Ohta-Kawasaki equation, providing a framework for handling derivatives in nonlinear terms.", "field": "math", "label": 1}
{"text": "Title: The log-Characteristic Polynomial of Generalized Wigner Matrices is Log-Correlated\nAbstract: We prove that in the limit of large dimension, the distribution of the logarithm of the characteristic polynomial of a generalized Wigner matrix converges to a log-correlated field. In particular, this shows that the limiting joint fluctuations of the eigenvalues are also log-correlated. Our argument mirrors that of \\cite{BouMod2019}, which is in turn based on the three-step argument of \\cite{ErdPecRmSchYau2010,ErdSchYau2011Uni}, but applies to a wider class of models, and at the edge of the spectrum. We rely on (i) the results in the Gaussian cases, special cases of the results in \\cite{BouModPai2021}, (ii) the local laws of \\cite{ErdYauYin2012}(iii) the observable \\cite{Bou2020} introduced and its analysis of the stochastic advection equation this observable satisfies, and (iv) the argument for a central limit theorem on mesoscopic scales in \\cite{LanLopSos2021}. For the proof, we also establish a Wegner estimate and local law down to the microscopic scale, both at the edge of the spectrum.", "field": "math", "label": 0}
{"text": "Title: Fusion invariant character of p-groups\nAbstract: We consider complex characters of a p-group P, which are invariant under a fusion system F on P. Extending a theorem of B\\'arcenas--Cantarero to non-saturated fusion systems, we show that the number of indecomposable F-invariant characters of P is greater or equal than the number of F-conjugacy classes of P. We further prove that these two quantities coincide whenever F is realized by a p-solvable group. On the other hand, we observe that this is false for constrained fusion systems in general. Finally, we construct a saturated fusion system with an indecomposable F-invariant character, which is not a summand of the regular character of P. This disproves a recent conjecture of Cantarero--Combariza.", "field": "math", "label": 1}
{"text": "Title: Forcing Over a Free Suslin Tree\nAbstract: We introduce an abstract framework for forcing over a free Suslin tree with suborders of products of forcings which add some structure to the tree using countable approximations. The main ideas of this framework are consistency, separation, and the Key Property. We give three applications of this framework: specializing derived trees of a free Suslin tree, adding uncountable almost disjoint subtrees of a free Suslin tree, and adding almost disjoint automorphisms of a free Suslin tree. Using the automorphism forcing, we construct a model in which there is an almost Kurepa Suslin tree and a non-saturated Aronszajn tree, and there does not exist a Kurepa tree. This model solves open problems due to Bilaniuk, Moore, and Jin and Shelah.", "field": "math", "label": 1}
{"text": "Title: Global and local minima of $α$-Brjuno functions\nAbstract: The aim of this article is to analyze some peculiar features of the global (and local) minima of $\\alpha$-Brjuno functions $B_\\alpha$ where $\\alpha\\in[\\frac{1}{2},1].$ Our starting point is the result by Balazard--Martin (2020), who showed that the minimum of $B_1$ is attained at $g:=\\frac{\\sqrt 5 -1}{2}$; analyzing the scaling properties of $B_1$ near $g$ we shall deduce that all preimages of $g$ under the Gauss map are also local minima for $B_1$. Next we consider the problem of characterizing global and local minima of $B_\\alpha$ for other values of $\\alpha$: we show that for $\\alpha\\in (g,1)$ the global minimum is again attained at $g$, while for $\\alpha=1/2$ the function $B_{1/2}$ attains its minimum at $\\gamma:=\\sqrt{2}-1$.", "field": "math", "label": 1}
{"text": "Title: A Survey of Data-Efficient Graph Learning\nAbstract: Graph-structured data, prevalent in domains ranging from social networks to biochemical analysis, serve as the foundation for diverse real-world systems. While graph neural networks demonstrate proficiency in modeling this type of data, their success is often reliant on significant amounts of labeled data, posing a challenge in practical scenarios with limited annotation resources. To tackle this problem, tremendous efforts have been devoted to enhancing graph machine learning performance under low-resource settings by exploring various approaches to minimal supervision. In this paper, we introduce a novel concept of Data-Efficient Graph Learning (DEGL) as a research frontier, and present the first survey that summarizes the current progress of DEGL. We initiate by highlighting the challenges inherent in training models with large labeled data, paving the way for our exploration into DEGL. Next, we systematically review recent advances on this topic from several key aspects, including self-supervised graph learning, semi-supervised graph learning, and few-shot graph learning. Also, we state promising directions for future research, contributing to the evolution of graph machine learning.", "field": "cs", "label": 0}
{"text": "Title: An Analytical Approach for Intermodal Urban Transportation Network Equilibrium including Shared Mobility Services\nAbstract: Shared Mobility Services (SMSs) are reshaping urban transportation systems by providing flexible mobility options. With their capacity to decrease the number of cars on the roads, these services can potentially improve the transportation system's performance in terms of travel times and emissions. This emphasizes the importance of analyzing and understanding their impacts on the system and users' choices, especially when integrated into a complex multi-modal system, including public transport (PT). Many studies overlook the synergies between SMSs and PT, leading to inaccurate traffic estimations and planning. This research offers an exhaustive review of multi-modal transportation system models involving SMSs. We then introduce a traffic assignment analytical model framed as a Mixed-Integer Quadratic Problem (MIQP). This model comprises diverse travel possibilities, including SMSs, and handles intermodality by allowing commuters to combine modes to optimize time and monetary expense. An in-depth examination of commuters' behavior on two test cases and an analysis of the price of anarchy highlights the disparities between user equilibrium and system optimum in such intricate systems.", "field": "math", "label": 1}
{"text": "Title: A Theoretical Analysis of Noise Geometry in Stochastic Gradient Descent\nAbstract: In this paper, we provide a theoretical study of noise geometry for minibatch stochastic gradient descent (SGD), a phenomenon where noise aligns favorably with the geometry of local landscape. We propose two metrics, derived from analyzing how noise influences the loss and subspace projection dynamics, to quantify the alignment strength. We show that for (over-parameterized) linear models and two-layer nonlinear networks, when measured by these metrics, the alignment can be provably guaranteed under conditions independent of the degree of over-parameterization. To showcase the utility of our noise geometry characterizations, we present a refined analysis of the mechanism by which SGD escapes from sharp minima. We reveal that unlike gradient descent (GD), which escapes along the sharpest directions, SGD tends to escape from flatter directions and cyclical learning rates can exploit this SGD characteristic to navigate more effectively towards flatter regions. Lastly, extensive experiments are provided to support our theoretical findings.", "field": "cs", "label": 1}
{"text": "Title: A Pseudodifferential Analytic Perspective on Getzler's Rescaling\nAbstract: Inspired by Gilkey's invariance theory, Getzler's rescaling method and Scott's approach to the index via Wodzicki residues, we give a localisation formula for the $\\mathbb Z_2$-graded Wodzicki residue of the logarithm of a class of differential operators acting on sections of a spinor bundle over an even-dimensional manifold. This formula is expressed in terms of another local density built from the symbol of the logarithm of a limit of rescaled differential operators acting on differential forms. When applied to complex powers of the square of a Dirac operator, it amounts to expressing the index of a Dirac operator in terms of a local density involving the logarithm of the Getzler rescaled limit of its square.", "field": "math", "label": 1}
{"text": "Title: Building ideals of two-Lipschitz operators between mertic and Banach spaces\nAbstract: In this paper, we present and characterize the injective hull of a two-Lipschitz operator ideals and the definition of two-Lipschitz dual operator ideal. Also we introduce two methods for creating ideals of two-Lipschitz operators from a pair of Lipschitz operator ideals. Namely, Lipschitzization and factorization method. We show the closedness, the injectivity and the symmetry of these two-Lipschitz ideals according to the closedness, injectivity and symmetry of the corresponding Lipschitz operator ideals. Some illustrative examples are given.", "field": "math", "label": 0}
{"text": "Title: Approximating maximum-size properly colored forests\nAbstract: In the Properly Colored Spanning Tree problem, we are given an edge-colored undirected graph and the goal is to find a properly colored spanning tree, i.e., a spanning tree in which any two adjacent edges have distinct colors. The problem is interesting not only from a graph coloring point of view, but is also closely related to the Degree Bounded Spanning Tree and (1,2)-Traveling Salesman problems, two classical questions that have attracted considerable interest in combinatorial optimization and approximation theory. Previous work on properly colored spanning trees has mainly focused on determining the existence of such a tree and hence has not considered the question from an algorithmic perspective. We propose an optimization version called Maximum-size Properly Colored Forest problem, which aims to find a properly colored forest with as many edges as possible. We consider the problem in different graph classes and for different numbers of colors, and present polynomial-time approximation algorithms as well as inapproximability results for these settings. Our proof technique relies on the sum of matching matroids defined by the color classes, a connection that might be of independent combinatorial interest. We also consider the Maximum-size Properly Colored Tree problem, which asks for the maximum size of a properly colored tree not necessarily spanning all the vertices. We show that the optimum is significantly more difficult to approximate than in the forest case, and provide an approximation algorithm for complete multigraphs.", "field": "cs", "label": 0}
{"text": "Title: On the $O(\\frac{\\sqrt{d}}{T^{1/4}})$ Convergence Rate of RMSProp and Its Momentum Extension Measured by $\\ell_1$ Norm: Better Dependence on the Dimension\nAbstract: Although adaptive gradient methods have been extensively used in deep learning, their convergence rates have not been thoroughly studied, particularly with respect to their dependence on the dimension. This paper considers the classical RMSProp and its momentum extension and establishes the convergence rate of $\\frac{1}{T}\\sum_{k=1}^TE\\left[\\|\\nabla f(x^k)\\|_1\\right]\\leq O(\\frac{\\sqrt{d}}{T^{1/4}})$ measured by $\\ell_1$ norm without the bounded gradient assumption, where $d$ is the dimension of the optimization variable and $T$ is the iteration number. Since $\\|x\\|_2\\ll\\|x\\|_1\\leq\\sqrt{d}\\|x\\|_2$ for problems with extremely large $d$, our convergence rate can be considered to be analogous to the $\\frac{1}{T}\\sum_{k=1}^TE\\left[\\|\\nabla f(x^k)\\|_2\\right]\\leq O(\\frac{1}{T^{1/4}})$ one of SGD measured by $\\ell_1$ norm.", "field": "math", "label": 0}
{"text": "Title: Lightweight Pixel Difference Networks for Efficient Visual Representation Learning\nAbstract: Recently, there have been tremendous efforts in developing lightweight Deep Neural Networks (DNNs) with satisfactory accuracy, which can enable the ubiquitous deployment of DNNs in edge devices. The core challenge of developing compact and efficient DNNs lies in how to balance the competing goals of achieving high accuracy and high efficiency. In this paper we propose two novel types of convolutions, dubbed \\emph{Pixel Difference Convolution (PDC) and Binary PDC (Bi-PDC)} which enjoy the following benefits: capturing higher-order local differential information, computationally efficient, and able to be integrated with existing DNNs. With PDC and Bi-PDC, we further present two lightweight deep networks named \\emph{Pixel Difference Networks (PiDiNet)} and \\emph{Binary PiDiNet (Bi-PiDiNet)} respectively to learn highly efficient yet more accurate representations for visual tasks including edge detection and object recognition. Extensive experiments on popular datasets (BSDS500, ImageNet, LFW, YTF, \\emph{etc.}) show that PiDiNet and Bi-PiDiNet achieve the best accuracy-efficiency trade-off. For edge detection, PiDiNet is the first network that can be trained without ImageNet, and can achieve the human-level performance on BSDS500 at 100 FPS and with $<$1M parameters. For object recognition, among existing Binary DNNs, Bi-PiDiNet achieves the best accuracy and a nearly $2\\times$ reduction of computational cost on ResNet18. Code available at \\href{https://github.com/hellozhuo/pidinet}{https://github.com/hellozhuo/pidinet}.", "field": "cs", "label": 1}
{"text": "Title: Identifiability of Direct Effects from Summary Causal Graphs\nAbstract: Dynamic structural causal models (SCMs) are a powerful framework for reasoning in dynamic systems about direct effects which measure how a change in one variable affects another variable while holding all other variables constant. The causal relations in a dynamic structural causal model can be qualitatively represented with an acyclic full-time causal graph. Assuming linearity and no hidden confounding and given the full-time causal graph, the direct causal effect is always identifiable. However, in many application such a graph is not available for various reasons but nevertheless experts have access to the summary causal graph of the full-time causal graph which represents causal relations between time series while omitting temporal information and allowing cycles. This paper presents a complete identifiability result which characterizes all cases for which the direct effect is graphically identifiable from a summary causal graph and gives two sound finite adjustment sets that can be used to estimate the direct effect whenever it is identifiable.", "field": "cs", "label": 1}
{"text": "Title: Auction-Based Scheduling\nAbstract: Many sequential decision-making tasks require satisfaction of multiple, partially contradictory objectives. Existing approaches are monolithic, namely all objectives are fulfilled using a single policy, which is a function that selects a sequence of actions. We present auction-based scheduling, a modular framework for multi-objective decision-making problems. Each objective is fulfilled using a separate policy, and the policies can be independently created, modified, and replaced. Understandably, different policies with conflicting goals may choose conflicting actions at a given time. In order to resolve conflicts, and compose policies, we employ a novel auction-based mechanism. We allocate a bounded budget to each policy, and at each step, the policies simultaneously bid from their available budgets for the privilege of being scheduled and choosing an action. Policies express their scheduling urgency using their bids and the bounded budgets ensure long-run scheduling fairness. We lay the foundations of auction-based scheduling using path planning problems on finite graphs with two temporal objectives. We present decentralized algorithms to synthesize a pair of policies, their initially allocated budgets, and bidding strategies. We consider three categories of decentralized synthesis problems, parameterized by the assumptions that the policies make on each other: (a) strong synthesis, with no assumptions and strongest guarantees, (b) assume-admissible synthesis, with weakest rationality assumptions, and (c) assume-guarantee synthesis, with explicit contract-based assumptions. For reachability objectives, we show that, surprisingly, decentralized assume-admissible synthesis is always possible when the out-degrees of all vertices are at most two.", "field": "cs", "label": 0}
{"text": "Title: Covering All Bases: The Next Inning in DNA Sequencing Efficiency\nAbstract: DNA emerges as a promising medium for the exponential growth of digital data due to its density and durability. This study extends recent research by addressing the \\emph{coverage depth problem} in practical scenarios, exploring optimal error-correcting code pairings with DNA storage systems to minimize coverage depth. Conducted within random access settings, the study provides theoretical analyses and experimental simulations to examine the expectation and probability distribution of samples needed for files recovery. Structured into sections covering definitions, analyses, lower bounds, and comparative evaluations of coding schemes, the paper unveils insights into effective coding schemes for optimizing DNA storage systems.", "field": "cs", "label": 1}
{"text": "Title: Link Prediction Accuracy on Real-World Networks Under Non-Uniform Missing Edge Patterns\nAbstract: Real-world network datasets are typically obtained in ways that fail to capture all links, and there are many different non-uniform ways in which real data might be missing. Nevertheless, uniform missing data is a common assumption made when no additional information is available about the underlying ''missingness function.'' To investigate the impact of different missingness patterns on link prediction accuracy, we employ 9 link prediction algorithms from 4 different families to analyze 20 different missingness functions categorized into 5 groups. By studying 250 real-world network datasets, we illustrate that different prediction algorithms exhibit significant differences in accuracy contingent upon both the dataset domain and the nature of the missingness pattern. Our study thereby provides guidance for selecting appropriate prediction algorithms when encountering diverse patterns of missing data across various domains, emphasizing the importance of considering the specific characteristics of the dataset for effective link prediction.", "field": "math", "label": 0}
{"text": "Title: On the Bessenrodt-Ono type inequality for a wide class of $A$-partition functions\nAbstract: The $A$-partition function $p_A(n)$ enumerates those partitions of $n$ whose parts belong to a fixed (finite or infinite) set $A$ of positive integers. On the other hand, the extended $A$-partition function $p_A\\left(\\boldsymbol{\\mu}\\right)$ is defined as an multiplicative extension of the $A$-partition function to a function on $A$-partitions. In this paper, we investigate the Bessenrodt-Ono type inequality for a wide class of $A$-partition functions. In particular, we examine the property for both the $m$-ary partition function $b_m(n)$ and the $d$-th power partition function $p_d(n)$. Moreover, we show that $b_m(\\boldsymbol{\\mu})$ ($p_d(\\boldsymbol{\\mu})$) takes its maximum value at an explicitly described set of $m$-ary partitions (power partitions), where $\\boldsymbol{\\mu}$ is an $m$-ary partition (a power partition) of $n$. Additionally, we exhibit analogous results for the Fibonacci partition function and the `factorial' partition function. It is worth pointing out that an elementary combinatorial reasoning plays a crucial role in our investigation.", "field": "math", "label": 0}
{"text": "Title: Higher Order Tsirelson Spaces and their Modified Versions are Isomorphic\nAbstract: We prove that for every countable ordinal $\\xi$, the Tsirelson's space $T_\\xi$ of order $\\xi$, is naturally, i.e., via the identity, $3$-isomorphc to its modified version. For the first step, we prove that the Schreier family $\\mathcal{S}_\\xi$ is the same as its modified version $ \\mathcal{S}^M_\\xi$, thus answering a question by Argyros and Tolias. As an application, we show that the algebra of linear bounded operators on $T_\\xi$ has $2^{\\mathfrak c}$ closed ideals.", "field": "math", "label": 1}
{"text": "Title: A note on colour-bias perfect matchings in hypergraphs\nAbstract: A result of Balogh, Csaba, Jing and Pluh\\'ar yields the minimum degree threshold that ensures a $2$-coloured graph contains a perfect matching of significant colour-bias (i.e., a perfect matching that contains significantly more than half of its edges in one colour). In this note we prove an analogous result for perfect matchings in $k$-uniform hypergraphs. More precisely, for each $2\\leq \\ell <k$ and $r\\geq 2$ we determine the minimum $\\ell$-degree threshold for forcing a perfect matching of significant colour-bias in an $r$-coloured $k$-uniform hypergraph.", "field": "math", "label": 0}
{"text": "Title: Separable commutative algebras and Galois theory in stable homotopy theories\nAbstract: We relate two different proposals to extend the \\'etale topology into homotopy theory, namely via the notion of finite cover introduced by Mathew and via the notion of separable commutative algebra introduced by Balmer. We show that finite covers are precisely those separable commutative algebras with underlying dualizable module, which have a locally constant and finite degree function. We then use Galois theory to classify separable commutative algebras in numerous categories of interest. Examples include the category of modules over a connective $\\mathbb{E}_\\infty$-ring $R$ which is either connective or even periodic with $\\pi_0(R)$ regular Noetherian in which $2$ acts invertibly, the stable module category of a finite group of $p$-rank one and the derived category of a qcqs scheme.", "field": "math", "label": 1}
{"text": "Title: Soft-linkedness\nAbstract: We have revised the softness property introduced by Brendle and Judah, resulting in the definition of a class of posets called $\\sigma$-soft-linked. Our research demonstrates that these posets work well to preserve the evasion number as well as the bounding number small in generic extensions. Furthermore, we establish a connection between our concept and the Fr\\'echet-linked notion introduced by Mej\\'ia.", "field": "math", "label": 1}
{"text": "Title: Uniform Moment Bounds for Generalized Jackson Networks in Multi-scale Heavy Traffic\nAbstract: We establish uniform moment bounds for steady-state queue lengths of generalized Jackson networks (GJNs) in multi-scale heavy traffic as recently proposed by Dai et al. [2023]. Uniform moment bounds lay the foundation for further analysis of the limit stationary distribution. Our result can be used to verify the crucial moment state space collapse (SSC) assumption in Dai et al. [2023] to establish a product-form limit of GJN in the multi-scale heavy traffic regime. Our proof critically utilizes the Palm version of the basic adjoint relationship (BAR) as developed in Braverman et al. [2023].", "field": "math", "label": 1}
{"text": "Title: Corruption-Robust Lipschitz Contextual Search\nAbstract: I study the problem of learning a Lipschitz function with corrupted binary signals. The learner tries to learn a $L$-Lipschitz function $f: [0,1]^d \\rightarrow [0, L]$ that the adversary chooses. There is a total of $T$ rounds. In each round $t$, the adversary selects a context vector $x_t$ in the input space, and the learner makes a guess to the true function value $f(x_t)$ and receives a binary signal indicating whether the guess is high or low. In a total of $C$ rounds, the signal may be corrupted, though the value of $C$ is \\emph{unknown} to the learner. The learner's goal is to incur a small cumulative loss. This work introduces the new algorithmic technique \\emph{agnostic checking} as well as new analysis techniques. I design algorithms which: for the symmetric loss, the learner achieves regret $L\\cdot O(C\\log T)$ with $d = 1$ and $L\\cdot O_d(C\\log T + T^{(d-1)/d})$ with $d > 1$; for the pricing loss, the learner achieves regret $L\\cdot \\widetilde{O} (T^{d/(d+1)} + C\\cdot T^{1/(d+1)})$.", "field": "cs", "label": 1}
{"text": "Title: Stability of isometric immersions of hypersurfaces\nAbstract: We prove a stability result of isometric immersions of hypersurfaces in Riemannian manifolds, with respect to $L^p$-perturbations of their fundamental forms: For a manifold $M^d$ endowed with a reference metric and a reference shape operator, we show that a sequence of immersions $f_n:M^d\\to N^{d+1}$, whose pullback metrics and shape operators are arbitrary close in $L^p$ to the reference ones, converge to an isometric immersion having the reference shape operator. This result is motivated by elasticity theory and generalizes a previous result by the authors to a general target manifold $N$, removing a constant curvature assumption. The method of proof differs from that in Alpern et al.: it extends a Young measure approach that was used in codimension-0 stability results, together with an appropriate relaxation of the energy and a regularity result for immersions satisfying given fundamental forms. In addition, we prove a related quantitative (rather than asymptotic) stability result in the case of Euclidean target, similar to Ciarlet et al. (Anal. Appl. 2019) but with no a-priori assumed bounds.", "field": "math", "label": 1}
{"text": "Title: Solitons to Mean Curvature Flow in the hyperbolic 3-space\nAbstract: We consider {translators} (i.e., initial condition of translating solitons) to mean curvature flow (MCF) in the hyperbolic $3$-space $\\mathbb H^3$, providing existence and classification results. More specifically, we show the existence and uniqueness of two distinct one-parameter families of complete rotational translators in $\\mathbb H^3$, one containing catenoid-type translators, and the other parabolic cylindrical ones. We establish a tangency principle for translators in $\\mathbb H^3$ and apply it to prove that properly immersed translators to MCF in $\\mathbb H^3$ are not cylindrically bounded. As a further application of the tangency principle, we prove that any horoconvex translator which is complete or transversal to the $x_3$-axis is necessarily an open set of a horizontal horosphere. In addition, we classify all translators in $\\mathbb H^3$ which have constant mean curvature. We also consider rotators (i.e., initial condition of rotating solitons) to MCF in $\\mathbb H^3$ and, after classifying the rotators of constant mean curvature, we show that there exists a one-parameter family of complete rotators which are all helicoidal, bringing to the hyperbolic context a distinguished result by Halldorsson, set in $\\mathbb R^3$.", "field": "math", "label": 1}
{"text": "Title: Gelfand-Tsetlin modules for Lie algebras of rank $2$\nAbstract: We explicitly construct families of simple modules for Lie algebras of rank $2$, on which certain commutative subalgebra acts diagonally and has a simple spectrum. In type $A$ these modules are well known generic Gelfand-Tsetlin modules and they can be viewed as such for other rank $2$ Lie algebras.", "field": "math", "label": 0}
{"text": "Title: FineBio: A Fine-Grained Video Dataset of Biological Experiments with Hierarchical Annotation\nAbstract: In the development of science, accurate and reproducible documentation of the experimental process is crucial. Automatic recognition of the actions in experiments from videos would help experimenters by complementing the recording of experiments. Towards this goal, we propose FineBio, a new fine-grained video dataset of people performing biological experiments. The dataset consists of multi-view videos of 32 participants performing mock biological experiments with a total duration of 14.5 hours. One experiment forms a hierarchical structure, where a protocol consists of several steps, each further decomposed into a set of atomic operations. The uniqueness of biological experiments is that while they require strict adherence to steps described in each protocol, there is freedom in the order of atomic operations. We provide hierarchical annotation on protocols, steps, atomic operations, object locations, and their manipulation states, providing new challenges for structured activity understanding and hand-object interaction recognition. To find out challenges on activity understanding in biological experiments, we introduce baseline models and results on four different tasks, including (i) step segmentation, (ii) atomic operation detection (iii) object detection, and (iv) manipulated/affected object detection. Dataset and code are available from https://github.com/aistairc/FineBio.", "field": "cs", "label": 1}
{"text": "Title: On the optimal objective value of random linear programs\nAbstract: We consider the problem of maximizing $\\langle c,x \\rangle$ subject to the constraints $Ax \\leq \\mathbf{1}$, where $x\\in{\\mathbb R}^n$, $A$ is an $m\\times n$ matrix with mutually independent symmetric subgaussian entries of unit variance, and $c$ is a normalized cost vector. In the regime $n\\to\\infty$, $\\frac{m}{n}\\to\\infty$, and under the assumption that $c$ is incompressible, we obtain sharp lower bounds on the optimal objective value $z^*$ of the linear program. In the context of high-dimensional convex geometry, our findings imply that the spherical mean width ${\\mathcal W}(P)$ of the random convex polyhedron $P=\\{x\\in{\\mathbb R}^n:\\; Ax\\leq \\mathbf{1}\\}$ satisfies $$ \\liminf\\limits_{n\\to\\infty}\\sqrt{2\\log(m/n)}\\,{\\mathcal W}(P)\\geq 2 $$ almost surely, with the matching upper bound available in the Gaussian setting. We provide extensive numerical experiments as supporting data for the theoretical predictions. Further, we carry out numerical studies for limiting distributions and standard deviations of $z^*$ and ${\\mathcal W}(P)$, and formulate several conjectures regarding their asymptotics.", "field": "math", "label": 1}
{"text": "Title: Neural Risk Limiting Dispatch in Power Networks: Formulation and Generalization Guarantees\nAbstract: Risk limiting dispatch (RLD) has been proposed as an approach that effectively trades off economic costs with operational risks for power dispatch under uncertainty. However, how to solve the RLD problem with provably near-optimal performance still remains an open problem. This paper presents a learning-based solution to this challenge. We first design a data-driven formulation for the RLD problem, which aims to construct a decision rule that directly maps day-ahead observable information to cost-effective dispatch decisions for the future delivery interval. Unlike most existing works that follow a predict-then-optimize paradigm, this end-to-end rule bypasses the additional suboptimality introduced by separately handling prediction and optimization. We then propose neural RLD, a novel solution method to the data-driven formulation. This method leverages an L2-regularized neural network to learn the decision rule, thereby transforming the data-driven formulation into a neural network training task that can be efficiently completed by stochastic gradient descent. A theoretical performance guarantee is further established to bound the suboptimality of our method, which implies that its suboptimality approaches to zero with high probability as more samples are utilized. Simulation tests across various systems demonstrate our method's superior performance in convergence, suboptimality, and computational efficiency compared with benchmarks.", "field": "math", "label": 1}
{"text": "Title: Rigidity of compact quasi-Einstein manifolds with boundary\nAbstract: In this article, we investigate the geometry of compact quasi-Einstein manifolds with boundary. We establish the possible values for the constant scalar curvature of a compact quasi-Einstein manifold with boundary. Moreover, we show that a $3$-dimensional simply connected compact $m$-quasi-Einstein manifold with boundary and constant scalar curvature must be isometric, up to scaling, to either the standard hemisphere $\\mathbb{S}^{3}_{+}$, or the cylinder $\\left[0,\\frac{\\sqrt{m}}{\\sqrt{\\lambda}}\\,\\pi\\right]\\times\\mathbb{S}^2$ with the product metric. For dimension $n=4,$ we prove that a $4$-dimensional simply connected compact $m$-quasi-Einstein manifold $M^4$ with boundary and constant scalar curvature is isometric, up to scaling, to either the standard hemisphere $\\mathbb{S}^{4}_{+},$ or the cylinder $\\left[0,\\frac{\\sqrt{m}}{\\sqrt{\\lambda}}\\,\\pi\\right]\\times\\mathbb{S}^3$ with the product metric, or the product space $\\mathbb{S}^{2}_{+}\\times\\mathbb{S}^2$ with the doubly warped product metric. Other related results for arbitrary dimensions are also discussed.", "field": "math", "label": 0}
{"text": "Title: Necessary players and values\nAbstract: In this paper we introduce the $\\Gamma$ value, a new value for cooperative games with transferable utility. We also provide an axiomatic characterization of the $\\Gamma$ value based on a property concerning the so-called necessary players. A necessary players of a game is one without which the characteristic function is zero. We illustrate the performance of the $\\Gamma$ value in a particular cost allocation problem that arises when the owners of the apartments in a building plan to install an elevator and share its installation cost; in the resulting example we compare the proposals of the $\\Gamma$ value, the equal division value and the Shapley value in two different scenarios. In addition, we propose an extension of the $\\Gamma$ value for cooperative games with transferable utility and with a coalition structure. Finally, we provide axiomatic characterizations of the coalitional $\\Gamma$ value and of the Owen and Banzhaf-Owen values using alternative properties concerning necessary players.", "field": "cs", "label": 0}
{"text": "Title: Saturated ideals from Laver collapses\nAbstract: Addressing a question of Shioya, we show that two-step iterations of the Laver collapse can force saturated ideals and Chang conjectures.", "field": "math", "label": 0}
{"text": "Title: On the minimization k-valued logic functions in the class of disjunctive normal forms\nAbstract: The paper considers the representation of k-valued logical functions in the class of disjunctive normal forms. Various classes of monotone functions of k-valued logic are investigated. Theorems are proved on the coincidence of reduced and shortest disjunctive nominal forms of k-valued functions. For a certain class of k-valued monotone functions, we prove an estimate for the number of functions in this class. we prove criteria for the absorption of elementary conjunctions by a first-order neighborhood of disjunctive normal forms of k-valued functions.", "field": "math", "label": 0}
{"text": "Title: The Sherali-Adams and Weisfeiler-Leman hierarchies in (Promise Valued) Constraint Satisfaction Problems\nAbstract: In this paper we study the interactions between so-called fractional relaxations of the integer programs (IPs) which encode homomorphism and isomorphism of relational structures. We give a combinatorial characterization of a certain natural linear programming (LP) relaxation of homomorphism in terms of fractional isomorphism. As a result, we show that the families of constraint satisfaction problems (CSPs) that are solvable by such linear program are precisely those that are closed under an equivalence relation which we call Weisfeiler-Leman invariance. We also generalize this result to the much broader framework of Promise Valued Constraint Satisfaction Problems, which brings together two well-studied extensions of the CSP framework. Finally, we consider the hierarchies of increasingly tighter relaxations of the homomorphism and isomorphism IPs obtained by applying the Sherali-Adams and Weisfeiler-Leman methods respectively. We extend our combinatorial characterization of the basic LP to higher levels of the Sherali-Adams hierarchy, and we generalize a well-known logical characterization of the Weisfeiler-Leman test from graphs to relational structures.", "field": "cs", "label": 1}
{"text": "Title: Construction and spectrum of the Anderson Hamiltonian with white noise potential on $\\mathbf{R}^2$ and $\\mathbf{R}^3$\nAbstract: We propose a simple construction of the Anderson Hamiltonian with white noise potential on $\\mathbf{R}^2$ and $\\mathbf{R}^3$ based on the solution theory of the parabolic Anderson model. It relies on a theorem of Klein and Landau [KL81] that associates a unique self-adjoint generator to a symmetric semigroup satisfying some mild assumptions. Then, we show that almost surely the spectrum of this random Schr\\\"odinger operator is $\\mathbf{R}$. To prove this result, we extend the method of Kotani [Kot85] to our setting of singular random operators.", "field": "math", "label": 1}
{"text": "Title: Generalized (co)homology of symmetric quandles over homogeneous Beck modules\nAbstract: A quandle equipped with a good involution is referred to as symmetric. It is known that the cohomology of symmetric quandles gives rise to strong cocycle invariants for classical and surface links, even when they are not necessarily oriented. In this paper, we introduce the category of symmetric quandle modules and prove that these modules completely determine the Beck modules in the category of symmetric quandles. Consequently, this establishes suitable coefficient objects for constructing appropriate (co)homology theories. We develop an extension theory of modules over symmetric quandles and propose a generalized (co)homology theory for symmetric quandles with coefficients in a homogeneous Beck module, which also recovers the symmetric quandle (co)homology developed by Kamada and Oshiro [Trans. Amer. Math. Soc. (2010)]. Our constructions also apply to symmetric racks. We conclude by establishing an explicit isomorphism between the second cohomology of a symmetric quandle and the first cohomology of its associated group.", "field": "math", "label": 1}
{"text": "Title: Construction of signed distance functions with an elliptic equation\nAbstract: Motivated by recent progress of structural optimization problems, the paper presents a new method for constructing the distance function to the boundary of given sets of interest, which simplifies the optimization procedure. We extend the celebrated Varadhan's elliptic equation theory in 1967 by adding the source term to the equation, in which we encode the information about the set. We will also establish the rate of convergence in this new framework, which is sharp at least in the one-dimensional case.", "field": "math", "label": 0}
{"text": "Title: Identifying Quality Mersenne Twister Streams For Parallel Stochastic Simulations\nAbstract: The Mersenne Twister (MT) is a pseudo-random number generator (PRNG) widely used in High Performance Computing for parallel stochastic simulations. We aim to assess the quality of common parallelization techniques used to generate large streams of MT pseudo-random numbers. We compare three techniques: sequence splitting, random spacing and MT indexed sequence. The TestU01 Big Crush battery is used to evaluate the quality of 4096 streams for each technique on three different hardware configurations. Surprisingly, all techniques exhibited almost 30% of defects with no technique showing better quality than the others. While all 106 Big Crush tests showed failures, the failure rate was limited to a small number of tests (maximum of 6 tests failed per stream, resulting in over 94% success rate). Thanks to 33 CPU years, high-quality streams identified are given. They can be used for sensitive parallel simulations such as nuclear medicine and precise high-energy physics applications.", "field": "cs", "label": 0}
{"text": "Title: Tiered approach for rapid damage characterisation of infrastructure enabled by remote sensing and deep learning technologies\nAbstract: Critical infrastructure such as bridges are systematically targeted during wars and conflicts. This is because critical infrastructure is vital for enabling connectivity and transportation of people and goods, and hence, underpinning the national and international defence planning and economic growth. Mass destruction of bridges, along with minimal or no accessibility to these assets during natural and anthropogenic disasters, prevents us from delivering rapid recovery. As a result, systemic resilience is drastically reduced. A solution to this challenge is to use technology for stand-off observations. Yet, no method exists to characterise damage at different scales, i.e. regional, asset, and structural (component), and more so there is little or no systematic correlation between assessments at scale. We propose an integrated three-level tiered approach to fill this capability gap, and we demonstrate the methods for damage characterisation enabled by fit-for-purpose digital technologies. Next, this method is applied and validated to a case study in Ukraine that includes 17 bridges. From macro to micro, we deploy technology at scale, from Sentinel-1 SAR images, crowdsourced information, and high-resolution images to deep learning for damaged infrastructure. For the first time, the interferometric coherence difference and semantic segmentation of images were deployed to improve the reliability of damage characterisations from regional to infrastructure component level, when enhanced assessment accuracy is required. This integrated method improves the speed of decision-making, and thus, enhances resilience. Keywords: critical infrastructure, damage characterisation, targeted attacks, restoration", "field": "cs", "label": 0}
{"text": "Title: On local rigidity theorems with respect to the scalar curvature\nAbstract: In this paper we discuss the local rigidity theorems with respect to scalar curvature by using the Ricci flow. Let $M$ be an $n$-dimensional manifold and $V$ is an open subset in $M$. We prove that if $V$ satisfies that the scalar curvature is non-negative and isoperimetric constant is no less than that of Euclidean space, then $V$ is flat. We also obtain that if the Perelman's local $\\nu$-entropy is non-negative for $V$ , then $V$ must be flat. As a corollory, we can improve a rigidity result obtained by Bakry, Concordet and Ledoux \\cite{BCL} and Ni\\cite{Ni2}, and show that if $V$ has the non-negative scalar curvature and the $L^2$-logarithmic Sobolev inequality with the best constant of Euclidean space, then $V$ must be flat.", "field": "math", "label": 0}
{"text": "Title: First moment of Hecke eigenvalues at the integers represented by binary quadratic forms\nAbstract: In the article, we consider a question concerning the estimation of summatory function of the Fourier coefficients of Hecke eigenforms indexed by a sparse set of integers. In particular, we provide an estimate for the following sum; \\begin{equation*} \\begin{split} S(f, \\mathcal{Q}; X ) &:= \\sideset{}{^{\\flat }}\\sum_{n= \\mathcal{Q}(\\underline{x}) \\le X \\atop \\gcd(n,N) =1 } \\lambda_{f}(n), \\end{split}\\end{equation*} where $\\flat$ means that sum runs over the square-free positive integers, $\\lambda_{f}(n)$ denotes the normalised $n^{\\rm th}$ Fourier coefficients of a Hecke eigenform $f$ of integral weight $k$ for the congruence subgroup $\\Gamma_{0}(N)$ and $\\mathcal{Q}$ is a primitive integral positive-definite binary quadratic forms of fixed discriminant $D<0$ with the class number $h(D)=1$. As a consequence, we determine the size, in terms of conductor of associated $L$-function, for the first sign change of Hecke eigenvalues indexed by the integers which are represented by $\\mathcal{Q}$. This work is an improvement and generalisation of the previous results.", "field": "math", "label": 1}
{"text": "Title: Quantum $X$-Secure $B$-Byzantine $T$-Colluding Private Information Retrieval\nAbstract: We consider the problems arising from the presence of Byzantine servers in a quantum private information retrieval (QPIR) setting. This is the first work to precisely define what the capabilities of Byzantine servers could be in a QPIR context. We show that quantum Byzantine servers have more capabilities than their classical counterparts due to the possibilities created by the quantum encoding procedure. We focus on quantum Byzantine servers that can apply any reversible operations on their individual qudits. In this case, the Byzantine servers can generate any error, i.e., this covers \\emph{all} possible single qudit operations that can be done by the Byzantine servers on their qudits. We design a scheme that is resilient to these kinds of manipulations. We show that the scheme designed achieves superdense coding gain in all cases, i.e., $R_Q= \\max \\left\\{0,\\min\\left\\{1,2\\left(1-\\frac{X+T+2B}{N}\\right)\\right\\}\\right\\}$.", "field": "cs", "label": 1}
{"text": "Title: 360-GS: Layout-guided Panoramic Gaussian Splatting For Indoor Roaming\nAbstract: 3D Gaussian Splatting (3D-GS) has recently attracted great attention with real-time and photo-realistic renderings. This technique typically takes perspective images as input and optimizes a set of 3D elliptical Gaussians by splatting them onto the image planes, resulting in 2D Gaussians. However, applying 3D-GS to panoramic inputs presents challenges in effectively modeling the projection onto the spherical surface of ${360^\\circ}$ images using 2D Gaussians. In practical applications, input panoramas are often sparse, leading to unreliable initialization of 3D Gaussians and subsequent degradation of 3D-GS quality. In addition, due to the under-constrained geometry of texture-less planes (e.g., walls and floors), 3D-GS struggles to model these flat regions with elliptical Gaussians, resulting in significant floaters in novel views. To address these issues, we propose 360-GS, a novel $360^{\\circ}$ Gaussian splatting for a limited set of panoramic inputs. Instead of splatting 3D Gaussians directly onto the spherical surface, 360-GS projects them onto the tangent plane of the unit sphere and then maps them to the spherical projections. This adaptation enables the representation of the projection using Gaussians. We guide the optimization of 360-GS by exploiting layout priors within panoramas, which are simple to obtain and contain strong structural information about the indoor scene. Our experimental results demonstrate that 360-GS allows panoramic rendering and outperforms state-of-the-art methods with fewer artifacts in novel view synthesis, thus providing immersive roaming in indoor scenarios.", "field": "cs", "label": 1}
{"text": "Title: The topological structure of isolated points in the space of $\\mathbb{Z}^d$-shifts\nAbstract: R.Pavlov and S.Schmieding provided recently some synthetic results about generic $\\mathbb{Z}$-shifts, which rely mainly on an original theorem stating that isolated points form a residual set in the space of $\\mathbb{Z}$-shifts such that all other residual set must contain it. As a direction for further research, they pointed towards genericity in the space of $\\mathbb{G}$-shifts, where $\\mathbb{G}$ is a finitely generated group. In the present text, we approach this for the case of $\\mathbb{Z}^d$-shifts, where $d \\ge 2$. As it is usual, multidimensional dynamical systems are much more difficult to understand. Provided the result of R.Pavlov and S.Schmieding, it is natural to begin with a better understanding of isolated points. We prove here a characterization of such points in the space of $\\mathbb{Z}^d$-shifts, in terms of the natural notion of maximal subsystems which we also introduce in this article. From this characterization we recover the one of R.Pavlov and S.Schmieding's. We also prove a series of results which exploit this notion. In particular some transitivity-like properties can be related to the number of maximal subsystems. Furthermore, on the contrary of dimension one, the set of isolated shifts is not residual. We also prove that the Cantor-Bendixson rank of the space of $\\mathbb{Z}^d$-shifts is infinite when $d > 1$, while it is equal to one when $d=1$.", "field": "math", "label": 0}
{"text": "Title: Regainingly approximable numbers and sets\nAbstract: We call an $\\alpha \\in \\mathbb{R}$ regainingly approximable if there exists a computable nondecreasing sequence $(a_n)_n$ of rational numbers converging to $\\alpha$ with $\\alpha - a_n < 2^{-n}$ for infinitely many $n \\in \\mathbb{N}$. We also call a set $A\\subseteq\\mathbb{N}$ regainingly approximable if it is c.e. and the strongly left-computable number $2^{-A}$ is regainingly approximable. We show that the set of regainingly approximable sets is neither closed under union nor intersection and that every c.e. Turing degree contains such a set. Furthermore, the regainingly approximable numbers lie properly between the computable and the left-computable numbers and are not closed under addition. While regainingly approximable numbers are easily seen to be i.o. $K$-trivial, we construct such an $\\alpha$ such that ${K(\\alpha \\restriction n)>n}$ for infinitely many $n$. Similarly, there exist regainingly approximable sets whose initial segment complexity infinitely often reaches the maximum possible for c.e. sets. Finally, there is a uniform algorithm splitting regular real numbers into two regainingly approximable numbers that are still regular.", "field": "math", "label": 1}
{"text": "Title: A Kümmer construction for Chern-Ricci flat balanced manifolds\nAbstract: Given a non-K\\\"ahler Calabi-Yau orbifold with a finite family of isolated singularities endowed with a Chern-Ricci flat balanced metric, we show, via a gluing construction, that all its crepant resolutions admit Chern-Ricci flat balanced metrics, and discuss applications to the search of solutions for the Hull-Strominger system. We also describe the scenario of singular threefolds with ordinary double points, and see that similarly is possible to obtain balanced approximately Chern-Ricci flat metrics.", "field": "math", "label": 0}
{"text": "Title: Producers Equilibria and Dynamics in Engagement-Driven Recommender Systems\nAbstract: Online platforms such as YouTube, Instagram, TikTok heavily rely on recommender systems to decide what content to show to which users. Content producers often aim to produce material that is likely to be shown to users and lead them to engage with said producer. To do so, producers try to align their content with the preferences of their targeted user base. In this work, we explore the equilibrium behavior of producers that are interested in maximizing user engagement. We study two variants of the content-serving rule that the platform's recommender system uses, and we show structural results on producers' production at equilibrium. We leverage these structural results to show that, in simple settings, we see specialization naturally arising from the competition among producers trying to maximize user engagement. We provide a heuristic for computing equilibria of our engagement game, and evaluate it experimentally. We show i) the performance and convergence of our heuristic, ii) the producer and user utilities at equilibrium, and iii) the level of producer specialization.", "field": "cs", "label": 0}
{"text": "Title: Exponential Ordering for Neutral Functional Differential Equations With Non-Autonomous Linear D-Operator\nAbstract: We study neutral functional differential equations with stable linear non-autonomous $D$-operator. The operator of convolution $\\hat{D}$ transforms $BU$ into $BU$. We show that, if $D$ is stable, then $\\hat{D}$ is invertible and, besides, $\\hat{D}$ and $\\hat{D}^{-1}$ are uniformly continuous for the compact-open topology on bounded sets. We introduce a new transformed exponential order and, under convenient assumptions, we deduce the 1-covering property of minimal sets. These conclusions are applied to describe the amount of material in a class of compartmental systems extensively studied in the literature.", "field": "math", "label": 0}
{"text": "Title: Fast Cerebral Blood Flow Analysis via Extreme Learning Machine\nAbstract: We introduce a rapid and precise analytical approach for analyzing cerebral blood flow (CBF) using Diffuse Correlation Spectroscopy (DCS) with the application of the Extreme Learning Machine (ELM). Our evaluation of ELM and existing algorithms involves a comprehensive set of metrics. We assess these algorithms using synthetic datasets for both semi-infinite and multi-layer models. The results demonstrate that ELM consistently achieves higher fidelity across various noise levels and optical parameters, showcasing robust generalization ability and outperforming iterative fitting algorithms. Through a comparison with a computationally efficient neural network, ELM attains comparable accuracy with reduced training and inference times. Notably, the absence of a back-propagation process in ELM during training results in significantly faster training speeds compared to existing neural network approaches. This proposed strategy holds promise for edge computing applications with online training capabilities.", "field": "cs", "label": 0}
{"text": "Title: LHS-spectral sequences for regular extensions of categories\nAbstract: In [F. Xu, On the cohomology rings of small categories, J. Pure Appl. Algebra 212 (2008), 2555-2569], Xu constructs a LHS-spectral sequence for target regular extensions of small categories. We extend this construction to ext-groups and construct a similar spectral sequence for source regular extensions (with right module coefficients). As a special case of these LHS-spectral sequences, we obtain three different versions of Slominska's spectral sequence for the cohomology of regular EI-categories. We show that many well-known spectral sequences related to the homology decompositions of finite groups, centric linking systems, and the orbit category of fusion systems can be obtained as the LHS-spectral sequence of an extension.", "field": "math", "label": 1}
{"text": "Title: On the best constants in Khintchine type inequalities for martingales\nAbstract: For discrete martingale-difference sequences $d=\\{d_1,\\ldots,d_n\\}$ we consider Khintchine type inequalities, involving certain square function $\\mathfrak S (d)$ considered by Chang-Wilson-Wolff in 1982. In particular, we prove \\begin{equation} \\left\\|\\sum_{k=1}^nd_k\\right\\|_p\\le 2^{1/2}\\big(\\Gamma((p+1)/2))/\\sqrt{\\pi}\\big)^{1/p}\\|\\mathfrak S(d)\\|_\\infty,\\quad p\\ge 3, \\end{equation} where the constant on the right hand side is the best possible and the same as known for the Rademacher sums $\\sum_{k=1}^na_kr_k$. Moreover, for a fixed $n$ the constant in the inequality can be replaced by $\\sum_{k=1}^nr_k/\\sqrt{n}$. We apply a technique, reducing the general case to the case of Haar and Rademacher sums, that allows also establish a sub-Gaussian estimate \\begin{equation} {\\bf E}\\left[\\exp\\left(\\lambda\\cdot \\left(\\frac{\\sum_{k=1}^nd_k}{\\|\\mathfrak S(d)\\|_\\infty}\\right)^2\\right)\\right]\\le \\frac{1}{\\sqrt{1-2\\lambda}},\\quad 0<\\lambda<1/2, \\end{equation} where the constant on the right hand side is the best possible.", "field": "math", "label": 1}
{"text": "Title: ReAGent: Towards A Model-agnostic Feature Attribution Method for Generative Language Models\nAbstract: Feature attribution methods (FAs), such as gradients and attention, are widely employed approaches to derive the importance of all input features to the model predictions. Existing work in natural language processing has mostly focused on developing and testing FAs for encoder-only language models (LMs) in classification tasks. However, it is unknown if it is faithful to use these FAs for decoder-only models on text generation, due to the inherent differences between model architectures and task settings respectively. Moreover, previous work has demonstrated that there is no `one-wins-all' FA across models and tasks. This makes the selection of a FA computationally expensive for large LMs since input importance derivation often requires multiple forward and backward passes including gradient computations that might be prohibitive even with access to large compute. To address these issues, we present a model-agnostic FA for generative LMs called Recursive Attribution Generator (ReAGent). Our method updates the token importance distribution in a recursive manner. For each update, we compute the difference in the probability distribution over the vocabulary for predicting the next token between using the original input and using a modified version where a part of the input is replaced with RoBERTa predictions. Our intuition is that replacing an important token in the context should have resulted in a larger change in the model's confidence in predicting the token than replacing an unimportant token. Our method can be universally applied to any generative LM without accessing internal model weights or additional training and fine-tuning, as most other FAs require. We extensively compare the faithfulness of ReAGent with seven popular FAs across six decoder-only LMs of various sizes. The results show that our method consistently provides more faithful token importance distributions.", "field": "cs", "label": 1}
{"text": "Title: An Accurate and Low-Parameter Machine Learning Architecture for Next Location Prediction\nAbstract: Next location prediction is a discipline that involves predicting a users next location. Its applications include resource allocation, quality of service, energy efficiency, and traffic management. This paper proposes an energy-efficient, small, and low parameter machine learning (ML) architecture for accurate next location prediction, deployable on modest base stations and edge devices. To accomplish this we ran a hundred hyperparameter experiments on the full human mobility patterns of an entire city, to determine an exact ML architecture that reached a plateau of accuracy with the least amount of model parameters. We successfully achieved a reduction in the number of model parameters within published ML architectures from 202 million down to 2 million. This reduced the total size of the model parameters from 791 MB down to 8 MB. Additionally, this decreased the training time by a factor of four, the amount of graphics processing unit (GPU) memory needed for training by a factor of twenty, and the overall accuracy was increased from 80.16% to 82.54%. This improvement allows for modest base stations and edge devices which do not have a large amount of memory or storage, to deploy and utilize the proposed ML architecture for next location prediction.", "field": "cs", "label": 0}
{"text": "Title: 3D Beamforming Through Joint Phase-Time Arrays\nAbstract: High-frequency wideband cellular communications over mmWave and sub-THz offer the opportunity for high data rates. However, it also presents high path loss, resulting in limited coverage. High-gain beamforming brought by the antenna array is essential to mitigate the coverage limitations. The conventional phased antenna arrays (PAA) cause high scheduling latency owing to analog beam constraints, i.e., only one frequency-flat beam is generated. Recently introduced joint phase-time array (JPTA) architecture, which utilizes both true-time-delay (TTD) units and phase shifters (PSs), alleviates analog beam constraints by creating multiple frequency-dependent beams for scheduling multiple users at different directions in a frequency-division manner. One class of previous studies offered solutions with \"rainbow\" beams, which tend to allocate a small bandwidth per beam direction. Another class focused on uniform linear array (ULA) antenna architecture, whose frequency-dependent beams were designed along a single axis of either azimuth or elevation direction. This paper presents a novel 3D beamforming design that maximizes beamforming gain toward desired azimuth and elevation directions and across sub-bands partitioned according to scheduled users' bandwidth requirements. We provide analytical solutions and iterative algorithms to design the PSs and TTD units for a desired subband beam pattern. Through simulations of the beamforming gain, we observe that our proposed solutions outperform the state-of-the-art solutions reported elsewhere.", "field": "cs", "label": 0}
{"text": "Title: Building graphs with high minimum degree on a budget\nAbstract: We consider the problem of constructing a graph of minimum degree $k\\ge 1$ in the following controlled random graph process, introduced recently by Frieze, Krivelevich and Michaeli. Suppose the edges of the complete graph on $n$ vertices are permuted uniformly at random. A player, Builder, sees the edges one by one, and must decide irrevocably upon seeing each edge whether to purchase it or not. Suppose Builder purchases an edge if and only if at least one endpoint has degree less than $k$ in her graph. Frieze, Krivelevich and Michaeli observed that this strategy succeeds in building a graph of minimum degree at least $k$ by $\\tau_k$, the hitting time for having minimum degree $k$. They conjectured that any strategy using $\\epsilon n$ fewer edges, where $\\epsilon>0$ is any constant, fails with high probability. In this paper we disprove their conjecture. We show that for $k\\ge 2$ Builder has a strategy which purchases $n/9$ fewer edges and succeeds with high probability in building a graph of minimum degree at least $k$ by $\\tau_k$. For $k=1$ we show that any strategy using $\\epsilon n$ fewer edges fails with probability bounded away from 0, and exhibit such a strategy that succeeds with probability bounded away from 0.", "field": "math", "label": 1}
{"text": "Title: Entropy-cost type Propagation of Chaos for Mean Field Interacting Particle System\nAbstract: In this paper, the quantitative entropy-cost type propagation of chaos for mean field interacting particle system is obtained, where the interaction is bounded and the initial distribution of mean field interacting particles converges to that of corresponding McKean-Vlasov SDEs in $L^1$-transportation cost $\\W_1^\\Psi$ induced by some cost function $\\Psi$. In the finite dimension case, the interaction is merely assumed to be bounded measurable and the noise can be multiplicative, while for the semi-linear SPDEs, the interaction is required to be bounded and Dini continuous. In addition, an example is presented for the infinite model.", "field": "math", "label": 0}
{"text": "Title: Computational Synthetic Cohomology Theory in Homotopy Type Theory\nAbstract: This paper discusses the development of synthetic cohomology in Homotopy Type Theory (HoTT), as well as its computer formalisation. The objectives of this paper are (1) to generalise previous work on integral cohomology in HoTT by the current authors and Brunerie (2022) to cohomology with arbitrary coefficients and (2) to provide the mathematical details of, as well as extend, results underpinning the computer formalisation of cohomology rings by the current authors and Lamiaux (2023). With respect to objective (1), we provide new direct definitions of the cohomology group operations and of the cup product, which, just as in (Brunerie et al., 2022), enable significant simplifications of many earlier proofs in synthetic cohomology theory. In particular, the new definition of the cup product allows us to give the first complete formalisation of the axioms needed to turn the cohomology groups into a graded commutative ring. We also establish that this cohomology theory satisfies the HoTT formulation of the Eilenberg-Steenrod axioms for cohomology and study the classical Mayer-Vietoris and Gysin sequences. With respect to objective (2), we characterise the cohomology groups and rings of various spaces, including the spheres, torus, Klein bottle, real/complex projective planes, and infinite real projective space. All results have been formalised in Cubical Agda and we obtain multiple new numbers, similar to the famous `Brunerie number', which can be used as benchmarks for computational implementations of HoTT. Some of these numbers are infeasible to compute in Cubical Agda and hence provide new computational challenges and open problems which are much easier to define than the original Brunerie number.", "field": "math", "label": 0}
{"text": "Title: Robustness in Wireless Distributed Learning: An Information-Theoretic Analysis\nAbstract: In this paper, we take an information-theoretic approach to understand the robustness in wireless distributed learning. Upon measuring the difference in loss functions, we provide an upper bound of the performance deterioration due to imperfect wireless channels. Moreover, we characterize the transmission rate under task performance guarantees and propose the channel capacity gain resulting from the inherent robustness in wireless distributed learning. An efficient algorithm for approximating the derived upper bound is established for practical use. The effectiveness of our results is illustrated by the numerical simulations.", "field": "cs", "label": 0}
{"text": "Title: Learning Based Dynamic Cluster Reconfiguration for UAV Mobility Management with 3D Beamforming\nAbstract: In modern cell-less wireless networks, mobility management is undergoing a significant transformation, transitioning from single-link handover management to a more adaptable multi-connectivity cluster reconfiguration approach, including often conflicting objectives like energy-efficient power allocation and satisfying varying reliability requirements. In this work, we address the challenge of dynamic clustering and power allocation for unmanned aerial vehicle (UAV) communication in wireless interference networks. Our objective encompasses meeting varying reliability demands, minimizing power consumption, and reducing the frequency of cluster reconfiguration. To achieve these objectives, we introduce a novel approach based on reinforcement learning using a masked soft actor-critic algorithm, specifically tailored for dynamic clustering and power allocation.", "field": "cs", "label": 0}
{"text": "Title: Universality of extremal eigenvalues of large random matrices\nAbstract: We prove that the spectral radius of a large random matrix $X$ with independent, identically distributed complex entries follows the Gumbel law irrespective of the distribution of the matrix elements. This solves a long-standing conjecture of Bordenave and Chafa{\\\"\\i} and it establishes the first universality result for one of the most prominent extremal spectral statistics in random matrix theory. Furthermore, we also prove that the argument of the largest eigenvalue is uniform on the unit circle and that the extremal eigenvalues of $X$ form a Poisson point process.", "field": "math", "label": 0}
{"text": "Title: Near and full quasi-optimality of finite element approximations of stationary second-order mean field games\nAbstract: We establish a priori error bounds for monotone stabilized finite element discretizations of stationary second-order mean field games (MFG) on Lipschitz polytopal domains. Under suitable hypotheses, we prove that the approximation is asymptotically nearly quasi-optimal in the $H^1$-norm in the sense that, on sufficiently fine meshes, the error between exact and computed solutions is bounded by the best approximation error of the corresponding finite element space, plus possibly an additional term, due to the stabilization, that is of optimal order with respect to the mesh size. We thereby deduce optimal rates of convergence of the error with respect to the mesh-size for solutions with sufficient regularity. We further show full asymptotic quasi-optimality of the approximation error in the more restricted case of sequences of strictly acute meshes. Our third main contribution is to further show, in the case where the domain is convex, that the convergence rate for the $H^1$-norm error of the value function approximation remains optimal even if the density function only has minimal regularity in $H^1$.", "field": "math", "label": 0}
{"text": "Title: Merging Multi-Task Models via Weight-Ensembling Mixture of Experts\nAbstract: Merging various task-specific Transformer-based models trained on different tasks into a single unified model can execute all the tasks concurrently. Previous methods, exemplified by task arithmetic, have been proven to be both effective and scalable. Existing methods have primarily focused on seeking a static optimal solution within the original model parameter space. A notable challenge is mitigating the interference between parameters of different models, which can substantially deteriorate performance. In this paper, we propose to merge most of the parameters while upscaling the MLP of the Transformer layers to a weight-ensembling mixture of experts (MoE) module, which can dynamically integrate shared and task-specific knowledge based on the input, thereby providing a more flexible solution that can adapt to the specific needs of each instance. Our key insight is that by identifying and separating shared knowledge and task-specific knowledge, and then dynamically integrating them, we can mitigate the parameter interference problem to a great extent. We conduct the conventional multi-task model merging experiments and evaluate the generalization and robustness of our method. The results demonstrate the effectiveness of our method and provide a comprehensive understanding of our method. The code is available at https://anonymous.4open.science/r/weight-ensembling_MoE-67C9/", "field": "cs", "label": 0}
{"text": "Title: Partitioning a Planar Graph into two Triangle-Forests\nAbstract: We show that the vertices of every planar graph can be partitioned into two sets, each inducing a so-called triangle-forest, i.e., a graph with no cycles of length more than three.", "field": "math", "label": 0}
{"text": "Title: Distributive properties of division points and discriminants of Drinfeld modules\nAbstract: We present a new notion of distribution and derived distribution of rank $r \\in \\mathbb{N}$ for a global function field $K$ with a distinguished place $\\infty$. It allows to describe the relations between division points, isogenies, and discriminants both for a fixed Drinfeld module of rank $r$ for the above data, or for the corresponding modular forms. We introduce and study three basic distributions with values in $\\mathbb{Q}$, in the group $\\mu(\\overline{K})$ of roots of unity in the algebraic closure $\\overline{K}$ of $K$, and in the group $U^{(1)}(C_{\\infty})$ of $1$-units of the completed algebraic closure $C_{\\infty}$ of $K_{\\infty}$, respectively. There result product formulas for division points and discriminants that encompass known results (e.g. analogues of Wallis' formula for $(2\\pi i)^{2}$ in the rank-$1$ case, of Jacobi's formula $\\Delta = (2\\pi i)^{12} q \\prod (1-q^{n})^{24}$ in the rank-$2$ case, and similar boundary expansions for $r > 2$) and several new ones: the definition of a canonical discriminant for the most general case of Drinfeld modules and the description of the sizes of division and discriminant forms. In the now classical case where $(K, \\infty) = (\\mathbb{F}_{q}(T), \\infty)$ and $r = 1$, $2$ or $3$, we give explicit values for the logarithms of such forms.", "field": "math", "label": 1}
{"text": "Title: Tiny Titans: Can Smaller Large Language Models Punch Above Their Weight in the Real World for Meeting Summarization?\nAbstract: Large Language Models (LLMs) have demonstrated impressive capabilities to solve a wide range of tasks without being explicitly fine-tuned on task-specific datasets. However, deploying LLMs in the real world is not trivial, as it requires substantial computing resources. In this paper, we investigate whether smaller, compact LLMs are a good alternative to the comparatively Larger LLMs2 to address significant costs associated with utilizing LLMs in the real world. In this regard, we study the meeting summarization task in a real-world industrial environment and conduct extensive experiments by comparing the performance of fine-tuned compact LLMs (e.g., FLAN-T5, TinyLLaMA, LiteLLaMA) with zero-shot larger LLMs (e.g., LLaMA-2, GPT-3.5, PaLM-2). We observe that most smaller LLMs, even after fine-tuning, fail to outperform larger zero-shot LLMs in meeting summarization datasets. However, a notable exception is FLAN-T5 (780M parameters), which performs on par or even better than many zero-shot Larger LLMs (from 7B to above 70B parameters), while being significantly smaller. This makes compact LLMs like FLAN-T5 a suitable cost-efficient solution for real-world industrial deployment.", "field": "cs", "label": 0}
{"text": "Title: Global solutions of Euler-Maxwell equations with dissipation\nAbstract: We consider the Cauchy problem for a damped Euler-Maxwell system with no ionic background. For smooth enough data satisfying suitable so-called dispersive conditions, we establish the global in time existence and uniqueness of a strong solution that decays uniformly in time. Our method is inspired by the works of D. Serre and M. Grassin dedicated to the compressible Euler system.", "field": "math", "label": 1}
{"text": "Title: Higher nearby cycles and central sheaves on affine flag varieties\nAbstract: In this paper we generalize and study a notion of (unipotent) nearby cycles over a higher dimensional base based on Be\\u{i}linson's description of unipotent nearby cycles, following an idea of Gaitsgory. This generalization, in the setting of affine Grassmannians, is required in recent work of Bezrukavnikov-Braverman-Finkelberg-Kazhdan.", "field": "math", "label": 0}
{"text": "Title: RadDQN: a Deep Q Learning-based Architecture for Finding Time-efficient Minimum Radiation Exposure Pathway\nAbstract: Recent advancements in deep reinforcement learning (DRL) techniques have sparked its multifaceted applications in the automation sector. Managing complex decision-making problems with DRL encourages its use in the nuclear industry for tasks such as optimizing radiation exposure to the personnel during normal operating conditions and potential accidental scenarios. However, the lack of efficient reward function and effective exploration strategy thwarted its implementation in the development of radiation-aware autonomous unmanned aerial vehicle (UAV) for achieving maximum radiation protection. Here, in this article, we address these intriguing issues and introduce a deep Q-learning based architecture (RadDQN) that operates on a radiation-aware reward function to provide time-efficient minimum radiation-exposure pathway in a radiation zone. We propose a set of unique exploration strategies that fine-tune the extent of exploration and exploitation based on the state-wise variation in radiation exposure during training. Further, we benchmark the predicted path with grid-based deterministic method. We demonstrate that the formulated reward function in conjugation with adequate exploration strategy is effective in handling several scenarios with drastically different radiation field distributions. When compared to vanilla DQN, our model achieves a superior convergence rate and higher training stability.", "field": "cs", "label": 0}
{"text": "Title: Multimodal Embodied Interactive Agent for Cafe Scene\nAbstract: With the surge in the development of large language models, embodied intelligence has attracted increasing attention. Nevertheless, prior works on embodied intelligence typically encode scene or historical memory in an unimodal manner, either visual or linguistic, which complicates the alignment of the model's action planning with embodied control. To overcome this limitation, we introduce the Multimodal Embodied Interactive Agent (MEIA), capable of translating high-level tasks expressed in natural language into a sequence of executable actions. Specifically, we propose a novel Multimodal Environment Memory (MEM) module, facilitating the integration of embodied control with large models through the visual-language memory of scenes. This capability enables MEIA to generate executable action plans based on diverse requirements and the robot's capabilities. We conduct experiments in a dynamic virtual cafe environment, utilizing multiple large models through zero-shot learning, and carefully design scenarios for various situations. The experimental results showcase the promising performance of our MEIA in various embodied interactive tasks.", "field": "cs", "label": 1}
{"text": "Title: Transitive $(q-1)$-fold packings of $\\rm{PG}_n(q)$\nAbstract: A $t$-fold packing of a projective space $\\rm{PG}_n(q)$ is a collection $\\mathcal{P}$ of line-spreads such that each line of $\\rm{PG}_n(q)$ occurs in precisely $t$ spreads in $\\mathcal{P}$. A $t$-fold packing $\\mathcal{P}$ is transitive if a subgroup of $\\rm{P\\Gamma L}_{n+1}(q)$ preserves and acts transitively on $\\mathcal{P}$. We give a construction for a transitive $(q-1)$-fold packing of $\\rm{PG}_n(q)$, where $q=2^k$, for any odd positive integers $n$ and $k$, such that $n\\geq 3$. This generalises a construction of Baker from 1976 for the case $q=2$.", "field": "math", "label": 0}
{"text": "Title: EXMOS: Explanatory Model Steering Through Multifaceted Explanations and Data Configurations\nAbstract: Explanations in interactive machine-learning systems facilitate debugging and improving prediction models. However, the effectiveness of various global model-centric and data-centric explanations in aiding domain experts to detect and resolve potential data issues for model improvement remains unexplored. This research investigates the influence of data-centric and model-centric global explanations in systems that support healthcare experts in optimising models through automated and manual data configurations. We conducted quantitative (n=70) and qualitative (n=30) studies with healthcare experts to explore the impact of different explanations on trust, understandability and model improvement. Our results reveal the insufficiency of global model-centric explanations for guiding users during data configuration. Although data-centric explanations enhanced understanding of post-configuration system changes, a hybrid fusion of both explanation types demonstrated the highest effectiveness. Based on our study results, we also present design implications for effective explanation-driven interactive machine-learning systems.", "field": "cs", "label": 1}
{"text": "Title: Distribution-uniform strong laws of large numbers\nAbstract: We revisit the question of whether the strong law of large numbers (SLLN) holds uniformly in a rich family of distributions, culminating in a distribution-uniform generalization of the Marcinkiewicz-Zygmund SLLN. These results can be viewed as extensions of Chung's distribution-uniform SLLN to random variables with uniformly integrable $q^\\text{th}$ absolute central moments for $0 < q < 2;\\ q \\neq 1$. Furthermore, we show that uniform integrability of the $q^\\text{th}$ moment is both sufficient and necessary for the SLLN to hold uniformly at the Marcinkiewicz-Zygmund rate of $n^{1/q - 1}$. These proofs centrally rely on distribution-uniform analogues of some familiar almost sure convergence results including the Khintchine-Kolmogorov convergence theorem, Kolmogorov's three-series theorem, a stochastic generalization of Kronecker's lemma, and the Borel-Cantelli lemmas. The non-identically distributed case is also considered.", "field": "math", "label": 0}
{"text": "Title: Mild Solution of Semilinear Rough Stochastic Evolution Equations\nAbstract: In this paper, we investigate a semilinear stochastic parabolic equation with a linear rough term $du_{t}=\\left[L_{t}u_{t}+f\\left(t, u_{t}\\right)\\right]dt+\\left(G_{t}u_{t}+g_{t}\\right)d\\mathbf{X}_{t}+h\\left(t, u_{t}\\right)dW_{t}$, where $\\left(L_{t}\\right)_{t \\in \\left[0, T\\right]}$ is a family of unbounded operators acting on a monotone family of interpolation Hilbert spaces, $\\mathbf{X}$ is a two-step $\\alpha$-H\\\"older rough path with $\\alpha \\in \\left(1/3, 1/2\\right]$ and $W$ is a Brownian motion. Existence and uniqueness of the mild solution are given through the stochastic controlled rough path approach and fixed-point argument. As a technical tool to define rough stochastic convolutions, we also develop a general mild stochastic sewing lemma, which is applicable for processes according to a monotone family.", "field": "math", "label": 1}
{"text": "Title: Completing the Asymptotic Classification of Mostly Symmetric Short Step Walks in an Orthant\nAbstract: In recent years, the techniques of analytic combinatorics in several variables (ACSV) have been applied to determine asymptotics for several families of lattice path models restricted to the orthant $\\mathbb{N}^d$ and defined by step sets $\\mathcal{S}\\subset\\{-1,0,1\\}^d\\setminus\\{\\mathbf{0}\\}$. Using the theory of ACSV for smooth singular sets, Melczer and Mishna determined asymptotics for the number of walks in any model whose set of steps $\\mathcal{S}$ is \"highly symmetric\" (symmetric over every axis). Building on this work, Melczer and Wilson determined asymptotics for all models where $\\mathcal{S}$ is \"mostly symmetric\" (symmetric over all but one axis) *except* for models whose set of steps have a vector sum of zero but are not highly symmetric. In this paper we complete the asymptotic classification of the mostly symmetric case by analyzing a family of saddle-point-like integrals whose amplitudes are singular near their saddle points.", "field": "math", "label": 0}
{"text": "Title: On the weak Harnack inequality for unbounded non-negative super-solutions of degenerate double-phase parabolic equations\nAbstract: In the case $q> p\\dfrac{n+2}{n}$, we give a proof of the weak Harnack inequality for non-negative super-solutions of degenerate double-phase parabolic equations under the additional assumption that $u\\in L^{s}_{loc}(\\Omega_{T})$ with some $s >p\\dfrac{n+2}{n}$.", "field": "math", "label": 1}
{"text": "Title: Structure of tight (k,0)-stable graphs\nAbstract: We say that a graph G is $(k,\\ell)$-stable if removing $k$ vertices from it reduces its independence number by at most $\\ell$. We say that G is tight $(k,\\ell)$-stable if it is $(k,\\ell)$-stable and its independence number equals $\\lfloor{\\frac{n-k+1}{2}\\rfloor}+\\ell$, the maximum possible, where $n$ is the vertex number of G. Answering and question of Dong and Wu, we show that every tight $(2,0)$-stable graph with odd vertex number must be an odd cycle. Moreover, we show that for all $k\\geq 3$, every tight $(k,0)$-stable graph has at most $k+6$ vertices.", "field": "math", "label": 0}
{"text": "Title: A compact formula for $P_λ(X;q,t)$\nAbstract: We give a compact tableau formula for the symmetric Macdonald polynomials $P_{\\lambda}(X;q,t)$ in terms of a queue inversion statistic on certain sorted non-attacking tableaux. Our tableaux are in bijection with the multiline queues defined by Martin, from which we obtain an alternative multiline queue formula for $P_{\\lambda}$.", "field": "math", "label": 0}
{"text": "Title: A Dirac-type theorem for arbitrary Hamiltonian $H$-linked digraphs\nAbstract: Given any digraph $D$, let $\\mathcal{P}(D)$ be the family of all directed paths in $D$, and let $H$ be a digraph with the arc set $A(H)=\\{a_1, \\ldots, a_k\\}$. The digraph $D$ is called arbitrary Hamiltonian $H$-linked if for any injective mapping $f: V(H)\\rightarrow V(D)$ and any integer set $\\mathcal{N}=\\{n_1, \\ldots, n_k\\}$ with $n_i\\geq4$ for each $i\\in\\{1, \\ldots, k\\}$, there exists a mapping $g: A(H)\\rightarrow \\mathcal{P}(D)$ such that for every arc $a_i=uv$, $g(a_i)$ is a directed path from $f(u)$ to $f(v)$ of length $n_i$, and different arcs are mapped into internally vertex-disjoint directed paths in $D$, and $\\bigcup_{i\\in[k]}V(g(a_i))=V(D)$. In this paper, we prove that for any digraph $H$ with $k$ arcs and $\\delta(H)\\geq1$, every digraph of sufficiently large order $n$ with minimum in- and out-degree at least $n/2+k$ is arbitrary Hamiltonian $H$-linked. Furthermore, we show that the lower bound is best possible. Our main result extends some work of K\\\"{u}hn and Osthus et al. \\cite{20081,20082} and Ferrara, Jacobson and Pfender \\cite{Jacobson}. Besides, as a corollary of our main theorem, we solve a conjecture of Wang \\cite{Wang} for sufficiently large graphs.", "field": "math", "label": 1}
{"text": "Title: On Mixed Cages of Girth 6\nAbstract: A [z,r;g]-mixed cage is a mixed graph of minimum order such that each vertex has z in-arcs, z out-arcs, r edges, and it has girth g. We present an infinite family of mixed graphs with girth 6. This construction also provides an upper bound on the minimum order of mixed cages of girth 6. Additionally,we introduce a lower bound on the minimum order for any mixed cage.", "field": "math", "label": 1}
{"text": "Title: Quasi-Perfect and Distance-Optimal Codes in the Sum-Rank Metric\nAbstract: Constructions of distance-optimal codes and quasi-perfect codes are challenging problems and have attracted many attentions. In this paper, we give the following three results. 1) If $\\lambda|q^{sm}-1$ and $\\lambda <\\sqrt{\\frac{(q^s-1)}{2(q-1)^2(1+\\epsilon)}}$, an infinite family of distance-optimal $q$-ary cyclic sum-rank codes with the block length $t=\\frac{q^{sm}-1}{\\lambda}$, the matrix size $s \\times s$, the cardinality $q^{s^2t-s(2m+3)}$ and the minimum sum-rank distance four is constructed. 2) Block length $q^4-1$ and the matrix size $2 \\times 2$ distance-optimal sum-rank codes with the minimum sum-rank distance four and the Singleton defect four are constructed. These sum-rank codes are close to the sphere packing bound , the Singleton-like bound and have much larger block length $q^4-1>>q-1$. 3) For given positive integers $m$ satisfying $2 \\leq m$, an infinite family of quasi-perfect sum-rank codes with the matrix size $2 \\times m$, and the minimum sum-rank distance three is also constructed. Quasi-perfect binary sum-rank codes with the minimum sum-rank distance four are also given. We show that more distance-optimal binary sum-rank codes can be obtained from the Plotkin sum.", "field": "cs", "label": 1}
{"text": "Title: Rarity of the infinite chains in the tree of numerical semigroups\nAbstract: We prove that, for each fixed genus, the portion of semigroups of that genus belonging to infinite chains in the semigroup tree approaches 0 as the genus grows to infinite. This means that most numerical semigroups have a finite number of descendants in the semigroup tree. This problem has been open since 2009.", "field": "math", "label": 1}
{"text": "Title: Partitions into powers of an algebraic number\nAbstract: We study partitions of complex numbers as sums of non-negative powers of a fixed algebraic number $\\beta$. We prove that if $\\beta$ is real quadratic, then the number of partitions is always finite if and only if some conjugate of $\\beta$ is larger than 1. Further, we show that for $\\beta$ satisfying a certain condition, the partition function attains all non-negative integers as values.", "field": "math", "label": 0}
{"text": "Title: Modular curves $X_0(N)$ with infinitely many quartic points\nAbstract: We determine all modular curves $X_0(N)$ with infinitely many quartic points. To do this, we define a pairing that induces a quadratic form representing all possible degrees of a rational morphism from $X_0(N)$ to a positive rank elliptic curve.", "field": "math", "label": 0}
{"text": "Title: Schur rings over Free Abelian Group of Rank Two\nAbstract: Schur rings are a type of subrings of group rings afforded by a partition of the underlined group. In this paper, Schur rings over free abelian group of rank two are classified under the assumption that one of the direct factor is a union of some basic sets. There are eight different types, and all but one type of which are traditional.", "field": "math", "label": 1}
{"text": "Title: Estimating Diffusion Degree on Graph Streams\nAbstract: The challenges of graph stream algorithms are twofold. First, each edge needs to be processed only once, and second, it needs to work on highly constrained memory. Diffusion degree is a measure of node centrality that can be calculated (for all nodes) trivially for static graphs using a single Breadth-First Search (BFS). However, keeping track of the Diffusion Degree in a graph stream is nontrivial. The memory requirement for exact calculation is equivalent to keeping the whole graph in memory. The present paper proposes an estimator (or sketch) of diffusion degree for graph streams. We prove the correctness of the proposed sketch and the upper bound of the estimated error. Given $\\epsilon, \\delta \\in (0,1)$, we achieve error below $\\epsilon(b_u-a_u)d_u\\lambda$ in node $u$ with probability $1-\\delta$ by utilizing $O(n\\frac1{\\epsilon^2}\\log{\\frac1{\\delta}})$ space, where $b_u$ and $a_u$ are the maximum and minimum degrees of neighbors of $u$, $\\lambda$ is diffusion probability, and $d_u$ is the degree of node $u$. With the help of this sketch, we propose an algorithm to extract the top-$k$ influencing nodes in the graph stream. Comparative experiments show that the spread of top-$k$ nodes by the proposed graph stream algorithm is equivalent to or better than the spread of top-$k$ nodes extracted by the exact algorithm.", "field": "cs", "label": 0}
{"text": "Title: DP-SGD with weight clipping\nAbstract: Recently, due to the popularity of deep neural networks and other methods whose training typically relies on the optimization of an objective function, and due to concerns for data privacy, there is a lot of interest in differentially private gradient descent methods. To achieve differential privacy guarantees with a minimum amount of noise, it is important to be able to bound precisely the sensitivity of the information which the participants will observe. In this study, we present a novel approach that mitigates the bias arising from traditional gradient clipping. By leveraging a public upper bound of the Lipschitz value of the current model and its current location within the search domain, we can achieve refined noise level adjustments. We present a new algorithm with improved differential privacy guarantees and a systematic empirical evaluation, showing that our new approach outperforms existing approaches also in practice.", "field": "cs", "label": 0}
{"text": "Title: A Bernstein-von Mises Theorem for Generalized Fiducial Distributions\nAbstract: We prove a Bernstein-von Mises result for generalized fiducial distributions following the approach based on quadratic mean differentiability in Le Cam (1986); van der Vaart (1998). Building on their approach, we introduce only two additional conditions for the generalized fiducial setting. While asymptotic normality of generalized fiducial distributions has been studied before, particularly in Hannig (2009) and Sonderegger and Hannig (2014), this work significantly extends the usefulness of such a result by the much more general condition of quadratic mean differentiability. We demonstrate the applicability of our result with two examples that necessitate these more general assumptions: the triangular distributions and free-knot spline models.", "field": "math", "label": 1}
{"text": "Title: Periodic Solutions of the parabolic-elliptic Keller-Segel system on whole spaces\nAbstract: In this paper, we investigate to the existence and uniqueness of periodic solutions for the parabolic-elliptic Keller-Segel system on whole spaces detailized by Euclid space $\\mathbb{R}^n\\,\\,(n \\geqslant 4)$ and real hyperbolic space $\\mathbb{H}^n\\,\\, (n \\geqslant 2)$. We work in framework of scritical spaces such as on weak-Lorentz space $L^{\\frac{n}{2},\\infty}(\\mathbb{R}^n)$ to obtain the results for Keller-Segel system on $\\mathbb{R}^n$ and on $L^{\\frac{p}{2}}(\\mathbb{H}^n)\\, (p>n)$ to obtain the ones on $\\mathbb{H}^n$. Our method is based on the dispersive and smoothing estimates of the heat semiroup and fixed point arguments. This work provides also a fully comparison between the asymptotic behaviours of periodic mild solutions of Keller-Segel system obtained in $\\mathbb{R}^n$ and the one in $\\mathbb{H}^n$.", "field": "math", "label": 1}
{"text": "Title: Large amplitude traveling waves for the non-resistive MHD system\nAbstract: We prove the existence of large amplitude bi-periodic traveling waves (stationary in a moving frame) of the two-dimensional non-resistive Magnetohydrodynamics (MHD) system with a traveling wave external force with large velocity speed $\\lambda (\\omega_1, \\omega_2)$ and of amplitude of order $O(\\lambda^{1^+})$ where $\\lambda \\gg 1$ is a large parameter. For most values of $\\omega = (\\omega_1, \\omega_2)$ and for $\\lambda \\gg 1$ large enough, we construct bi-periodic traveling wave solutions of arbitrarily large amplitude as $\\lambda \\to + \\infty$. More precisely, we show that the velocity field is of order $O(\\lambda^{0^+})$, whereas the magnetic field is close to a constant vector as $\\lambda \\to + \\infty$. Due to the presence of small divisors, the proof is based on a nonlinear Nash-Moser scheme adapted to construct nonlinear waves of large amplitude. The main difficulty is that the linearized equation at any approximate solution is an unbounded perturbation of large size of a diagonal operator and hence the problem is not perturbative. The invertibility of the linearized operator is then performed by using tools from micro-local analysis and normal forms together with a sharp analysis of high and low frequency regimes w.r. to the large parameter $\\lambda \\gg 1$. To the best of our knowledge, this is the first result in which global in time, large amplitude solutions are constructed for the 2D non-resistive MHD system with periodic boundary conditions and also the first existence results of large amplitude quasi-periodic solutions for a nonlinear PDE in higher space dimension.", "field": "math", "label": 0}
{"text": "Title: GD doesn't make the cut: Three ways that non-differentiability affects neural network training\nAbstract: This paper investigates the distinctions between gradient methods applied to non-differentiable functions (NGDMs) and classical gradient descents (GDs) designed for differentiable functions. First, we demonstrate significant differences in the convergence properties of NGDMs compared to GDs, challenging the applicability of the extensive neural network convergence literature based on $L-smoothness$ to non-smooth neural networks. Next, we demonstrate the paradoxical nature of NGDM solutions for $L_{1}$-regularized problems, showing that increasing the regularization penalty leads to an increase in the $L_{1}$ norm of optimal solutions in NGDMs. Consequently, we show that widely adopted $L_{1}$ penalization-based techniques for network pruning do not yield expected results. Finally, we explore the Edge of Stability phenomenon, indicating its inapplicability even to Lipschitz continuous convex differentiable functions, leaving its relevance to non-convex non-differentiable neural networks inconclusive. Our analysis exposes misguided interpretations of NGDMs in widely referenced papers and texts due to an overreliance on strong smoothness assumptions, emphasizing the necessity for a nuanced understanding of foundational assumptions in the analysis of these systems.", "field": "cs", "label": 0}
{"text": "Title: Triangle-free $2$-matchings\nAbstract: We consider the problem of finding a maximum size triangle-free $2$-matching in a graph $G$. A $2$-matching is any subset of the edges such that each vertex is incident to at most two edges from the subset. We present a fast combinatorial algorithm for the problem. Our algorithm and its analysis are dramatically simpler than the very complicated result by Hartvigsen from 1984. In the design of this algorithm we use several new concepts. It has been proven before that for any triangle-free $2$-matching $M$ which is not maximum the graph contains an $M$-augmenting path, whose application to $M$ results in a bigger triangle-free $2$-matching. It was not known how to efficiently find such a path. A new observation is that the search for an augmenting path $P$ can be restricted to so-called {\\em amenable} paths that go through any triangle $t$ contained in $P \\cup M$ a limited number of times. To find an augmenting path that is amenable and hence whose application does not create any triangle we forbid some edges to be followed by certain others. This operation can be thought of as using gadgets, in which some pairs of edges get disconnected. To be able to disconnect two edges we employ {\\em half-edges}. A {\\em half-edge} of edge $e$ is, informally speaking, a half of $e$ containing exactly one of its endpoints. This is another novel application of half-edges which were previously used for TSP and other matching problems. Additionally, gadgets are not fixed during any augmentation phase, but are dynamically changing according to the currently discovered state of reachability by amenable paths.", "field": "cs", "label": 1}
{"text": "Title: The Gâteaux derivative of the curvilinear boundary crossing probability of diffusion processes\nAbstract: For a general time-inhomogenous diffusion process $X$ and a boundary function $g,$ we analyse the probability $F(g)$ that $X$ stays beneath the boundary $g$ during a given finite time interval. We prove that, for $g \\in C^2,$ the functional $F(g)$ is G\\^ateaux-differentiable in directions $h \\in H \\cup C^2,$ where $H$ is the Cameron--Martin space, and derive a compact representation for the derivative of $F$. It is shown that, in the time-homogenous case, this representation coincides with the representation in terms of Brownian meander functionals obtained in this special case by Borovkov & Downes (2010). Our results can be useful when approximating $F(g)$ with computable values $F(\\widehat{g})$ for special boundaries $\\widehat{g}$ that are close to $g.$ We also obtain auxiliary results that can be of independent interest as well: (i) a probabilistic counterpart to the ``jump relation'' for single layer potentials for backward Kolmogorov equations on time-dependent domains, and (ii) a martingale representation for the indicator of the boundary non-crossing event for time-dependent boundaries.", "field": "math", "label": 0}
{"text": "Title: Hyperelliptically fibred surfaces with nodes\nAbstract: Using elementary methods of algebraic geometry, we present constructions of hyperelliptically fibred surfaces containing nodal fibres.", "field": "math", "label": 0}
{"text": "Title: The construction of a $E_7$-like quantum subgroup of $SU(3)$\nAbstract: In this short note we construct an embedding of the planar algebra for $\\overline{\\operatorname{Rep}(U_q(sl_3))}$ at $q = e^{2\\pi i \\frac{1}{24}}$ into the graph planar algebra of di Francesco and Zuber's candidate graph $\\mathcal{E}_4^{12}$. Via the graph planar algebra embedding theorem we thus construct a rank 11 module category over $\\overline{\\operatorname{Rep}(U_q(sl_3))}$ whose graph for action by the vector representation is $\\mathcal{E}_4^{12}$. This fills a small gap in the literature on the construction of $\\overline{\\operatorname{Rep}(U_q(sl_3))}$ module categories. As a consequence of our construction, we obtain the principal graphs of subfactors constructed abstractly by Evans and Pugh.", "field": "math", "label": 0}
{"text": "Title: Unipotent nearby cycles and nearby cycles over general bases\nAbstract: We show that under some conditions, two constructions of nearby cycles over general bases coincide. More specifically, we show that under the assumption of $\\Psi$-factorizability, the constructions of unipotent nearby cycles over an affine space can be described using the theory of nearby cycles over general bases via the vanishing topos. In particular, this applies to nearby cycles of Satake sheaves on Beilinson-Drinfeld Grassmannians with parahoric ramification.", "field": "math", "label": 0}
{"text": "Title: ECALL: Expectation-calibrated learning for unsupervised blind deconvolution\nAbstract: Blind deconvolution aims to recover an original image from a blurred version in the case where the blurring kernel is unknown. It has wide applications in diverse fields such as astronomy, microscopy, and medical imaging. Blind deconvolution is a challenging ill-posed problem that suffers from significant non-uniqueness. Solution methods therefore require the integration of appropriate prior information. Early approaches rely on hand-crafted priors for the original image and the kernel. Recently, deep learning methods have shown excellent performance in addressing this challenge. However, most existing learning methods for blind deconvolution require a paired dataset of original and blurred images, which is often difficult to obtain. In this paper, we present a novel unsupervised learning approach named ECALL (Expectation-CALibrated Learning) that uses separate unpaired collections of original and blurred images. Key features of the proposed loss function are cycle consistency involving the kernel and associated reconstruction operator, and terms that use expectation values of data distributions to obtain information about the kernel. Numerical results are used to support ECALL.", "field": "math", "label": 1}
{"text": "Title: On ordered groups of regular growth rates\nAbstract: We introduce an elementary class of linearly ordered groups, called growth order groups, encompassing certain groups under composition of formal series (e.g. transseries) as well as certain groups $\\mathcal{G}_{\\mathcal{M}}$ of infinitely large germs at infinity of unary functions definable in an o-minimal structure $\\mathcal{M}$. We study the algebraic structure of growth order groups and give methods for constructing examples. We show that if $\\mathcal{M}$ expands the real ordered field and germs in $\\mathcal{G}_{\\mathcal{M}}$ are levelled in the sense of Marker & Miller, then $\\mathcal{G}_{\\mathcal{M}}$ is a growth order group.", "field": "math", "label": 1}
{"text": "Title: Prismatic $G$-displays and descent theory\nAbstract: For a smooth affine group scheme $G$ over the ring of $p$-adic integers $\\mathbb{Z}_p$ and a cocharacter $\\mu$ of $G$, we study $G$-$\\mu$-displays over the prismatic site of Bhatt-Scholze. In particular, we obtain several descent results for them. If $G=\\mathrm{GL}_n$, then our $G$-$\\mu$-displays can be thought of as Breuil-Kisin modules with some additional conditions. The relation between our $G$-$\\mu$-displays and prismatic $F$-gauges introduced by Drinfeld and Bhatt-Lurie is also discussed. In fact, our results are formulated and proved for smooth affine group schemes over the ring of integers $\\mathcal{O}_E$ of any finite extension $E$ of $\\mathbb{Q}_p$ by using $\\mathcal{O}_E$-prisms, which are $\\mathcal{O}_E$-analogues of prisms.", "field": "math", "label": 1}
{"text": "Title: Memory Consistency Guided Divide-and-Conquer Learning for Generalized Category Discovery\nAbstract: Generalized category discovery (GCD) aims at addressing a more realistic and challenging setting of semi-supervised learning, where only part of the category labels are assigned to certain training samples. Previous methods generally employ naive contrastive learning or unsupervised clustering scheme for all the samples. Nevertheless, they usually ignore the inherent critical information within the historical predictions of the model being trained. Specifically, we empirically reveal that a significant number of salient unlabeled samples yield consistent historical predictions corresponding to their ground truth category. From this observation, we propose a Memory Consistency guided Divide-and-conquer Learning framework (MCDL). In this framework, we introduce two memory banks to record historical prediction of unlabeled data, which are exploited to measure the credibility of each sample in terms of its prediction consistency. With the guidance of credibility, we can design a divide-and-conquer learning strategy to fully utilize the discriminative information of unlabeled data while alleviating the negative influence of noisy labels. Extensive experimental results on multiple benchmarks demonstrate the generality and superiority of our method, where our method outperforms state-of-the-art models by a large margin on both seen and unseen classes of the generic image recognition and challenging semantic shift settings (i.e.,with +8.4% gain on CUB and +8.1% on Standford Cars).", "field": "cs", "label": 1}
{"text": "Title: Distilling Mathematical Reasoning Capabilities into Small Language Models\nAbstract: This work addresses the challenge of democratizing advanced Large Language Models (LLMs) by compressing their mathematical reasoning capabilities into sub-billion parameter Small Language Models (SLMs) without compromising performance. We introduce Equation-of-Thought Distillation (EoTD), a novel technique that encapsulates the reasoning process into equation-based representations to construct an EoTD dataset for fine-tuning SLMs. Additionally, we propose the Ensemble Thoughts Distillation (ETD) framework to enhance the reasoning performance of SLMs. This involves creating a reasoning dataset with multiple thought processes, including Chain-of-Thought (CoT), Program-of-Thought (PoT), and Equation-of-Thought (EoT), and using it for fine-tuning. Our experimental findings demonstrate that EoTD significantly boosts the reasoning abilities of SLMs, while ETD enables these models to achieve state-of-the-art reasoning performance.", "field": "cs", "label": 1}
{"text": "Title: MobilityDL: A Review of Deep Learning From Trajectory Data\nAbstract: Trajectory data combines the complexities of time series, spatial data, and (sometimes irrational) movement behavior. As data availability and computing power have increased, so has the popularity of deep learning from trajectory data. This review paper provides the first comprehensive overview of deep learning approaches for trajectory data. We have identified eight specific mobility use cases which we analyze with regards to the deep learning models and the training data used. Besides a comprehensive quantitative review of the literature since 2018, the main contribution of our work is the data-centric analysis of recent work in this field, placing it along the mobility data continuum which ranges from detailed dense trajectories of individual movers (quasi-continuous tracking data), to sparse trajectories (such as check-in data), and aggregated trajectories (crowd information).", "field": "cs", "label": 1}
{"text": "Title: Hierarchical Continual Reinforcement Learning via Large Language Model\nAbstract: The ability to learn continuously in dynamic environments is a crucial requirement for reinforcement learning (RL) agents applying in the real world. Despite the progress in continual reinforcement learning (CRL), existing methods often suffer from insufficient knowledge transfer, particularly when the tasks are diverse. To address this challenge, we propose a new framework, Hierarchical Continual reinforcement learning via large language model (Hi-Core), designed to facilitate the transfer of high-level knowledge. Hi-Core orchestrates a twolayer structure: high-level policy formulation by a large language model (LLM), which represents agenerates a sequence of goals, and low-level policy learning that closely aligns with goal-oriented RL practices, producing the agent's actions in response to the goals set forth. The framework employs feedback to iteratively adjust and verify highlevel policies, storing them along with low-level policies within a skill library. When encountering a new task, Hi-Core retrieves relevant experience from this library to help to learning. Through experiments on Minigrid, Hi-Core has demonstrated its effectiveness in handling diverse CRL tasks, which outperforms popular baselines.", "field": "cs", "label": 1}
{"text": "Title: Extensions of curves with high degree with respect to the genus\nAbstract: We classify linearly normal surfaces $S \\subset \\mathbf{P}^{r+1}$ of degree $d$ such that $4g-4 \\leq d \\leq 4g+4$, where $g>1$ is the sectional genus (it is a classical result that for larger $d$ there are only cones). We apply this to the study of the extension theory of pluricanonical curves and genus $3$ curves, whenever they verify Property $N_2$, using and slightly expanding the theory of integration of ribbons of the authors and E.~Sernesi. We compute the corank of the relevant Gaussian maps, and we show that all ribbons over such curves are integrable, and thus there exists a universal extension. We carry out a similar program for linearly normal hyperelliptic curves of degree $d\\geq 2g+3$. We classify surfaces having such a curve $C$ as a hyperplane section, compute the corank of the relevant Gaussian maps, and prove that all ribbons over $C$ are integrable if and only if $d=2g+3$. In the latter case we obtain the existence of a universal extension.", "field": "math", "label": 0}
{"text": "Title: Learning Planning-based Reasoning by Trajectories Collection and Process Reward Synthesizing\nAbstract: Large Language Models (LLMs) have demonstrated significant potential in handling complex reasoning tasks through step-by-step rationale generation. However, recent studies have raised concerns regarding the hallucination and flaws in their reasoning process. Substantial efforts are being made to improve the reliability and faithfulness of the generated rationales. Some approaches model reasoning as planning, while others focus on annotating for process supervision. Nevertheless, the planning-based search process often results in high latency due to the frequent assessment of intermediate reasoning states and the extensive exploration space. Additionally, supervising the reasoning process with human annotation is costly and challenging to scale for LLM training. To address these issues, in this paper, we propose a framework to learn planning-based reasoning through direct preference optimization (DPO) on collected trajectories, which are ranked according to synthesized process rewards. Our results on challenging logical reasoning benchmarks demonstrate the effectiveness of our learning framework, showing that our 7B model can surpass the strong counterparts like GPT-3.5-Turbo.", "field": "cs", "label": 1}
{"text": "Title: Purity and quasi-split torsors over Prüfer bases\nAbstract: We establish an analogue of the Zariski--Nagata purity theorem for finite \\'etale covers on smooth schemes over Pr\\\"ufer rings by demonstrating Auslander's flatness criterion in this non-Noetherian context. We derive an Auslander--Buchsbaum formula for general local rings, which provides a useful tool for studying the algebraic structures involved in our work. Through analysis of reflexive sheaves, we prove various purity theorems for torsors under certain group algebraic spaces, such as the reductive ones. Specifically, using results from EGAIV4 on parafactoriality on smooth schemes over normal bases, we prove the purity for cohomology groups of multiplicative type groups at this level of generality. Subsequently, we leverage the aforementioned purity results to resolve the Grothendieck--Serre conjecture for torsors under a quasi-split reductive group scheme over schemes smooth over Pr\\\"ufer rings. Along the way, we also prove a version of the Nisnevich purity conjecture for quasi-split reductive group schemes in our Pr\\\"uferian context, inspired by the recent work of Cesnavicius.", "field": "math", "label": 1}
{"text": "Title: Segment Anything in 3D Gaussians\nAbstract: 3D Gaussian Splatting has emerged as an alternative 3D representation of Neural Radiance Fields (NeRFs), benefiting from its high-quality rendering results and real-time rendering speed. Considering the 3D Gaussian representation remains unparsed, it is necessary first to execute object segmentation within this domain. Subsequently, scene editing and collision detection can be performed, proving vital to a multitude of applications, such as virtual reality (VR), augmented reality (AR), game/movie production, etc. In this paper, we propose a novel approach to achieve object segmentation in 3D Gaussian via an interactive procedure without any training process and learned parameters. We refer to the proposed method as SA-GS, for Segment Anything in 3D Gaussians. Given a set of clicked points in a single input view, SA-GS can generalize SAM to achieve 3D consistent segmentation via the proposed multi-view mask generation and view-wise label assignment methods. We also propose a cross-view label-voting approach to assign labels from different views. In addition, in order to address the boundary roughness issue of segmented objects resulting from the non-negligible spatial sizes of 3D Gaussian located at the boundary, SA-GS incorporates the simple but effective Gaussian Decomposition scheme. Extensive experiments demonstrate that SA-GS achieves high-quality 3D segmentation results, which can also be easily applied for scene editing and collision detection tasks. Codes will be released soon.", "field": "cs", "label": 1}
{"text": "Title: Reflexive Calkin algebras\nAbstract: For a Banach space $X$ denote by $\\mathcal{L}(X)$ the algebra of bounded linear operators on $X$, by $\\mathcal{K}(X)$ the compact operator ideal on $X$, and by $Cal(X) = \\mathcal{L}(X)/\\mathcal{K}(X)$ the Calkin algebra of $X$. We prove that $Cal(X)$ can be an infinite-dimensional reflexive Banach space, even isomorphic to a Hilbert space. More precisely, for every Banach space $U$ with a normalized unconditional basis not having a $c_0$ asymptotic version we construct a Banach space $\\mathfrak{X}_U$ and a sequence of mutually annihilating projections $(I_s)_{s=1}^\\infty$ on $\\mathfrak{X}_U$, i.e., $I_sI_t = 0$, for $s\\neq t$, such that $\\mathcal{L}(\\mathfrak{X}_U) = \\mathcal{K}(\\mathfrak{X}_U)\\oplus[(I_s)_{s=1}^\\infty]\\oplus\\mathbb{C}I$ and $(I_s)_{s=1}^\\infty$ is equivalent to $(u_s)_{s=1}^\\infty$. In particular, $Cal(\\mathfrak{X}_U)$ is isomorphic, as a Banach algebra, to the unitization of $U$ with coordinate-wise multiplication. Banach spaces $U$ meeting these criteria include $\\ell_p$ and $(\\oplus_n\\ell_\\infty^n)_p$, $1\\leq p<\\infty$, with their unit vector bases, $L_p$, $1 <p<\\infty$, with the Haar system, the asymptotic-$\\ell_1$ Tsirelson space and Schlumprecht space with their usual bases, and many others.", "field": "math", "label": 0}
{"text": "Title: Murphy's Law for Algebraic Stacks\nAbstract: We show that various natural algebro-geometric moduli stacks, including the stack of curves, have the property that every Deligne-Mumford gerbe over a field appears as the residual gerbe of one of their points. These gerbes are universal obstructions for objects of the stack to be defined over their fields of moduli, and for the corresponding coarse moduli space to be fine. Thus, our results show that many natural moduli stacks hold objects that are obstructed from being defined over their fields of moduli in every possible way, and have coarse spaces which fail to be fine moduli spaces in every possible way. A basic insight enabling our arguments is that many classical constructions in equivariant projective geometry generalize to the setting of relative geometry over an arbitrary Deligne-Mumford gerbe over a field.", "field": "math", "label": 0}
{"text": "Title: Polytope realization of cluster structures\nAbstract: Based on the construction of polytope functions and several results about them in [LP], we take a deep look on their mutation behaviors to find a link between a face of a polytope and a sub-cluster algebra of the corresponding cluster algebra. This find provides a way to induce a mutation sequence in a sub-cluster algebra from that in the cluster algebra in totally sign-skew-symmetric case analogous to that achieved via cluster scattering diagram in skew-symmetrizable case by [GHKK] and [M]. With this, we are able to generalize compatibility degree in [CL] and then obtain an equivalent condition of compatibility which does not rely on clusters and thus can be generalized for all polytope functions. Therefore, we could regard compatibility as an intrinsic property of variables, which explains the unistructurality of cluster algebras. According to such cluster structure of polytope functions, we construct a fan $\\mathcal{C}$ containing all cones in the $g$-fan. On the other hand, we also find a realization of $G$-matrices and $C$-matrices in polytopes by the mutation behaviors of polytopes, which helps to generalize the dualities between $G$-matrices and $C$-matrices introduced in [NZ] and leads to another polytope explanation of cluster structures. This allows us to construct another fan $\\mathcal{N}$ which also contains all cones in the $g$-fan.", "field": "math", "label": 1}
{"text": "Title: A modular Poincaré-Wirtinger type inequality on Lipschitz domains for Sobolev spaces with variable exponents\nAbstract: In the context of Sobolev spaces with variable exponents, Poincar\\'e--Wirtinger inequalities are possible as soon as Luxemburg norms are considered. On the other hand, modular versions of the inequalities in the expected form \\begin{equation*} \\int_\\Omega \\left|f(x)-\\langle f\\rangle_{\\Omega}\\right|^{p(x)} \\ {\\mathrm{d} x} \\leqslant C \\int_\\Omega|\\nabla f(x)|^{p(x)}{\\mathrm{d} x}, \\end{equation*} are known to be \\emph{false}. As a result, all available modular versions of the Poincar\\'e- Wirtinger inequality in the variable-exponent setting always contain extra terms that do not disappear in the constant exponent case, preventing such inequalities from reducing to the classical ones in the constant exponent setting. Our contribution is threefold. First, we establish that a modular Poincar\\'e--Wirtinger inequality particularizing to the classical one in the constant exponent case is indeed conceivable. We show that if $\\Omega\\subset \\mathbb{R}^n$ is a bounded Lipschitz domain, and if $p\\in L^\\infty(\\Omega)$, $p \\geq 1$, then for every $f\\in C^\\infty(\\bar\\Omega)$ the following generalized Poincar\\'e--Wirtinger inequality holds \\begin{equation*} \\int_\\Omega \\left|f(x)-\\langle f\\rangle_{\\Omega}\\right|^{p(x)} \\ {\\mathrm{d} x} \\leq C \\int_\\Omega\\int_\\Omega \\frac{|\\nabla f(z)|^{p(x)}}{|z-x|^{n-1}}\\ {\\mathrm{d} z}{\\mathrm{d} x}, \\end{equation*} where $\\langle f\\rangle_{\\Omega}$ denotes the mean of $f$ over $\\Omega$, and $C>0$ is a positive constant depending only on $\\Omega$ and $\\|p\\|_{L^\\infty(\\Omega)}$. Second, our argument is concise and constructive and does not rely on compactness results. Third, we additionally provide geometric information on the best Poincar\\'e--Wirtinger constant on Lipschitz domains.", "field": "math", "label": 1}
{"text": "Title: Exploring Simple, High Quality Out-of-Distribution Detection with L2 Normalization\nAbstract: We demonstrate that L2 normalization over feature space can produce capable performance for Out-of-Distribution (OoD) detection for some models and datasets. Although it does not demonstrate outright state-of-the-art performance, this method is notable for its extreme simplicity: it requires only two addition lines of code, and does not need specialized loss functions, image augmentations, outlier exposure or extra parameter tuning. We also observe that training may be more efficient for some datasets and architectures. Notably, only 60 epochs with ResNet18 on CIFAR10 (or 100 epochs with ResNet50) can produce performance within two percentage points (AUROC) of several state-of-the-art methods for some near and far OoD datasets. We provide theoretical and empirical support for this method, and demonstrate viability across five architectures and three In-Distribution (ID) datasets.", "field": "cs", "label": 1}
{"text": "Title: Genetic Programming Theory and Practice: A Fifteen-Year Trajectory\nAbstract: The GPTP workshop series, which began in 2003, has served over the years as a focal meeting for genetic programming (GP) researchers. As such, we think it provides an excellent source for studying the development of GP over the past fifteen years. We thus present herein a trajectory of the thematic developments in the field of GP.", "field": "cs", "label": 0}
{"text": "Title: Problems and related results in Algebraic Vision and Multiview Geometry\nAbstract: The article presents a survey of results in algebraic vision and multiview geometry. The starting points is the study of projective algebraic varieties critical for scene reconstruction. Initially studied for reconstructing static scenes in three-dimensional spaces, these critical loci are later investigated for dynamic and segmented scenes in higher-dimensional projective spaces. The formal analysis of the ideals of critical loci employs Grassmann tensors, introduced as crucial tools for determining these ideals and aiding the reconstruction process away from critical loci. A long-term goal of the authors with other co-authors involves two main aspects: firstly studying properties of Grassmann tensors, as rank, multi-rank and core, along with the varieties that parameterize these tensors; concurrently conducting an analysis of families of critical loci in various scenarios.", "field": "math", "label": 1}
{"text": "Title: B-Fredholm theory in Banach algebras\nAbstract: The aim of this paper is to develop a systematic B-Fredholm theory in semiprime Banach algebras. We first generalize Smyth's important punctured neighbourhood theorem to B-Fredholm elements. Then using this result, we investigate the local spectral theory of B-Fredholm elements, including the localized left (resp. right) SVEP and a classification of components of B-Fredholm resolvent set. Finally, in semisimple Banach algebra context, we characterize element $f$ such that $f^{n}$ belongs to the socle for some $n \\in \\mathbb{N}$ from two different perspectives: one is the invariance of the B-Fredholm spectrum under commuting perturbation $f$, the other is the Rieszness and the B-Fredholmness of $f$.", "field": "math", "label": 1}
{"text": "Title: ACT: Empowering Decision Transformer with Dynamic Programming via Advantage Conditioning\nAbstract: Decision Transformer (DT), which employs expressive sequence modeling techniques to perform action generation, has emerged as a promising approach to offline policy optimization. However, DT generates actions conditioned on a desired future return, which is known to bear some weaknesses such as the susceptibility to environmental stochasticity. To overcome DT's weaknesses, we propose to empower DT with dynamic programming. Our method comprises three steps. First, we employ in-sample value iteration to obtain approximated value functions, which involves dynamic programming over the MDP structure. Second, we evaluate action quality in context with estimated advantages. We introduce two types of advantage estimators, IAE and GAE, which are suitable for different tasks. Third, we train an Advantage-Conditioned Transformer (ACT) to generate actions conditioned on the estimated advantages. Finally, during testing, ACT generates actions conditioned on a desired advantage. Our evaluation results validate that, by leveraging the power of dynamic programming, ACT demonstrates effective trajectory stitching and robust action generation in spite of the environmental stochasticity, outperforming baseline methods across various benchmarks. Additionally, we conduct an in-depth analysis of ACT's various design choices through ablation studies. Our code is available at https://github.com/LAMDA-RL/ACT.", "field": "cs", "label": 0}
{"text": "Title: On the Torsion Congruence for Zeta Functions of Totally Real Fields\nAbstract: In this note, we study the special values for zeta functions of totally real fields using the Shintani's cone decomposition. We prove certain congruence between the special values for zeta functions under the prime degree field extension. This congruence implies the `torsion congruence' proved by Ritter-Weiss which is crucial in the proof of the noncommutative Iwasawa main conjecture for totally real fields.", "field": "math", "label": 0}
{"text": "Title: A Kaplansky Theorem for JB*-triples\nAbstract: Let $T:E\\rightarrow F$ be a non-necessarily continuous triple homomorphism from a (complex) JB$^*$-triple (respectively, a (real) J$^*$B-triple) to a normed Jordan triple. The following statements hold: (1) $T$ has closed range whenever $T$ is continuous (2) $T$ has closed range whenever $T$ is continuous This result generalises classical theorems of I. Kaplansky and S.B. Cleveland in the setting of C$^*$-algebras and of A. Bensebah and J.P\\'erez, L. Rico and A. Rodr'\\iguez Palacios in the setting of JB$^*$-algebras.", "field": "math", "label": 1}
{"text": "Title: Are Synthetic Time-series Data Really not as Good as Real Data?\nAbstract: Time-series data presents limitations stemming from data quality issues, bias and vulnerabilities, and generalization problem. Integrating universal data synthesis methods holds promise in improving generalization. However, current methods cannot guarantee that the generator's output covers all unseen real data. In this paper, we introduce InfoBoost -- a highly versatile cross-domain data synthesizing framework with time series representation learning capability. We have developed a method based on synthetic data that enables model training without the need for real data, surpassing the performance of models trained with real data. Additionally, we have trained a universal feature extractor based on our synthetic data that is applicable to all time-series data. Our approach overcomes interference from multiple sources rhythmic signal, noise interference, and long-period features that exceed sampling window capabilities. Through experiments, our non-deep-learning synthetic data enables models to achieve superior reconstruction performance and universal explicit representation extraction without the need for real data.", "field": "cs", "label": 0}
{"text": "Title: Symmetric Rank-$k$ Methods\nAbstract: This paper proposes a novel class of block quasi-Newton methods for convex optimization which we call symmetric rank-$k$ (SR-$k$) methods. Each iteration of SR-$k$ incorporates the curvature information with $k$ Hessian-vector products achieved from the greedy or random strategy. We prove SR-$k$ methods have the local superlinear convergence rate of $\\mathcal{O}\\big((1-k/d)^{t(t-1)/2}\\big)$ for minimizing smooth and strongly self-concordant function, where $d$ is the problem dimension and $t$ is the iteration counter. This is the first explicit superlinear convergence rate for block quasi-Newton methods and it successfully explains why block quasi-Newton methods converge faster than standard quasi-Newton methods in practice.", "field": "math", "label": 0}
{"text": "Title: On the existence of MRD self-dual codes\nAbstract: In this paper, we investigate the existence of self-dual MRD codes $C\\subset L^n$, where $L/F$ is an arbitrary field extension of degree $m\\geq n$. We then apply our results to the case of finite fields, and prove that if $m=n$ and $F=\\mathbb{F}_q$, a self-dual MRD code exists if and only if $q\\equiv n\\equiv 3 \\ [4].$", "field": "cs", "label": 1}
{"text": "Title: Distance-balancing of cube-connected cycles graphs\nAbstract: We show that cube-connected cycles graphs $CCC_n$ are distance-balanced, and nicely distance-balanced if and only if $n$ is even.", "field": "math", "label": 0}
{"text": "Title: Geometric Interpretations of Compatibility for Fundamental Matrices\nAbstract: In recent work, algebraic computational software was used to provide the exact algebraic conditions under which a sixtuple $\\{F^{ij}\\}$ of fundamental matrices, corresponding to $4$ images, will be compatible, i.e. there will exist cameras $\\{P_i\\}_{i=1}^4$ such that each pair $P_i,P_j$ has fundamental matrix $F^{ij}$; it has been further demonstrated that quadruplewise compatibility is sufficient for the problem of $n>4$ images. We expand on these prior results by proving equivalent geometric conditions for compatibility. We find that when the camera centers are in general position, compatibility can be characterized via the intersections of epipolar lines in each image. When the camera centers are coplanar, compatibility occurs when the prior condition holds and additionally any one camera center can be reconstructed via the other three.", "field": "math", "label": 1}
{"text": "Title: Curvature Operators on Kähler Manifolds\nAbstract: We prove that there exist K\\\"{a}hler manifolds that are not homotopy equivalent to a quotient of complex hyperbolic space but which admit a Riemannian metric with nonpositive curvature operator. This shows that K\\\"{a}hler manifolds do not satisfy the same type of rigidity with respect to the curvature operator as quaternionic hyperbolic and Cayley hyperbolic manifolds and are thus more similar to real hyperbolic manifolds in this setting. Along the way we also calculate explicit values for the eigenvalues of the curvature operator with respect to the standard complex hyperbolic metric.", "field": "math", "label": 0}
{"text": "Title: Joint Transceiver Optimization for MmWave/THz MU-MIMO ISAC Systems\nAbstract: In this paper, we consider the problem of joint transceiver design for millimeter wave (mmWave)/Terahertz (THz) multi-user MIMO integrated sensing and communication (ISAC) systems. Such a problem is formulated into a nonconvex optimization problem, with the objective of maximizing a weighted sum of communication users' rates and the passive radar's signal-to-clutter-and-noise-ratio (SCNR). By exploring a low-dimensional subspace property of the optimal precoder, a low-complexity block-coordinate-descent (BCD)-based algorithm is proposed. Our analysis reveals that the hybrid analog/digital beamforming structure can attain the same performance as that of a fully digital precoder, provided that the number of radio frequency (RF) chains is no less than the number of resolvable signal paths. Also, through expressing the precoder as a sum of a communication-precoder and a sensing-precoder, we develop an analytical solution to the joint transceiver design problem by generalizing the idea of block-diagonalization (BD) to the ISAC system. Simulation results show that with a proper tradeoff parameter, the proposed methods can achieve a decent compromise between communication and sensing, where the performance of each communication/sensing task experiences only a mild performance loss as compared with the performance attained by optimizing exclusively for a single task.", "field": "cs", "label": 0}
{"text": "Title: Non-Exchangeable Conformal Language Generation with Nearest Neighbors\nAbstract: Quantifying uncertainty in automatically generated text is important for letting humans check potential hallucinations and making systems more reliable. Conformal prediction is an attractive framework to provide predictions imbued with statistical guarantees, however, its application to text generation is challenging since any i.i.d. assumptions are not realistic. In this paper, we bridge this gap by leveraging recent results on non-exchangeable conformal prediction, which still ensures bounds on coverage. The result, non-exchangeable conformal nucleus sampling, is a novel extension of the conformal prediction framework to generation based on nearest neighbors. Our method can be used post-hoc for an arbitrary model without extra training and supplies token-level, calibrated prediction sets equipped with statistical guarantees. Experiments in machine translation and language modeling show encouraging results in generation quality. By also producing tighter prediction sets with good coverage, we thus give a more theoretically principled way to perform sampling with conformal guarantees.", "field": "cs", "label": 1}
{"text": "Title: Reduction for $(n+2)$-rigid subcategories in extriangulated categories\nAbstract: In this work we study how to extend the concept of \\emph{\"reduction,\"} given for rigid and functorially finite subcategories in an extriangulated category $\\mathcal{C}$, to $(n+2)$-rigid ones. We define the reduction of such subcategories as the intersection of orthogonal complements when certain orthogonal condition is satisfied and we prove that this reduction depends mainly on the subcategory itself beyond the type of extriangulated category for which belongs to. Specifically, we show that some results proven for Frobenius extriangulated categories can be carried to extriangulated categories in general. We also study its properties among we can mention: weakly idempotent completeness, existence of enough $\\mathbb{E}$-projectives and $\\mathbb{E}$-injectives, and conditions to be Frobenius. That generalization covers the usual case and for the general case (for $n\\geq 0$), we provide several examples. Finally, we extend a well-known result given for the reduction in stably $2$-Calabi Yau Frobenius extriangulated categories related with $2$-cluster tilting subcategories.", "field": "math", "label": 0}
{"text": "Title: Vision-LLMs Can Fool Themselves with Self-Generated Typographic Attacks\nAbstract: Recently, significant progress has been made on Large Vision-Language Models (LVLMs); a new class of VL models that make use of large pre-trained language models. Yet, their vulnerability to Typographic attacks, which involve superimposing misleading text onto an image remain unstudied. Furthermore, prior work typographic attacks rely on sampling a random misleading class from a predefined set of classes. However, the random chosen class might not be the most effective attack. To address these issues, we first introduce a novel benchmark uniquely designed to test LVLMs vulnerability to typographic attacks. Furthermore, we introduce a new and more effective typographic attack: Self-Generated typographic attacks. Indeed, our method, given an image, make use of the strong language capabilities of models like GPT-4V by simply prompting them to recommend a typographic attack. Using our novel benchmark, we uncover that typographic attacks represent a significant threat against LVLM(s). Furthermore, we uncover that typographic attacks recommended by GPT-4V using our new method are not only more effective against GPT-4V itself compared to prior work attacks, but also against a host of less capable yet popular open source models like LLaVA, InstructBLIP, and MiniGPT4.", "field": "cs", "label": 0}
{"text": "Title: Real-Time Coordination of Integrated Transmission and Distribution Systems: Flexibility Modeling and Distributed NMPC Scheduling\nAbstract: This paper proposes a real-time distributed operational architecture to efficiently coordinate intergrated transmission and distribution systems (ITD). At the distribution system level, the distribution system operator (DSO) computes the aggregated flexibility of all controllable devices by power-energy envelopes and provides them to the transmission system operators. At the transmission system level, a distributed nonlinear MPC approach is proposed to coordinate the economic dispatch of multiple TSOs, considering the aggregated flexibility of all distribution systems. The subproblems of the proposed approach are associated with different TSOs and individual time periods. In addition, the aggregated flexibility of controllable devices in distribution networks is encapsulated, re-calculated, and communicated through the power-energy envelopes, significantly reducing computational costs and eliminating redundant information exchanges between TSOs and DSOs for privacy and security preservation. The extensive numerical experiment demonstrates the scalability and the computational efficiency of the proposed distributed operational architecture.", "field": "math", "label": 1}
{"text": "Title: A non-asymptotic error analysis for parallel Monte Carlo estimation from many short Markov chains\nAbstract: Single-chain Markov chain Monte Carlo simulates realizations from a Markov chain to estimate expectations with the empirical average. The single-chain simulation is generally of considerable length and restricts many advantages of modern parallel computation. This paper constructs a novel many-short-chains Monte Carlo (MSC) estimator by averaging over multiple independent sums from Markov chains of a guaranteed short length. The computational advantage is the independent Markov chain simulations can be fast and may be run in parallel. The MSC estimator requires an importance sampling proposal and a drift condition on the Markov chain without requiring convergence analysis on the Markov chain. A non-asymptotic error analysis is developed for the MSC estimator under both geometric and multiplicative drift conditions. Empirical performance is illustrated on an autoregressive process and the P\\'olya-Gamma Gibbs sampler for Bayesian logistic regression to predict cardiovascular disease.", "field": "math", "label": 0}
{"text": "Title: Towards Optimal Grammars for RNA Structures\nAbstract: In past work (Onokpasa, Wild, Wong, DCC 2023), we showed that (a) for joint compression of RNA sequence and structure, stochastic context-free grammars are the best known compressors and (b) that grammars which have better compression ability also show better performance in ab initio structure prediction. Previous grammars were manually curated by human experts. In this work, we develop a framework for automatic and systematic search algorithms for stochastic grammars with better compression (and prediction) ability for RNA. We perform an exhaustive search of small grammars and identify grammars that surpass the performance of human-expert grammars.", "field": "cs", "label": 0}
{"text": "Title: Synchronous Consensus in Partial Synchrony\nAbstract: We demonstrate a deterministic Byzantine consensus algorithm with synchronous operation in partial synchrony. It is naturally leaderless, tolerates any number of f < n/2 Byzantine processes with two rounds of exchange of originator-only signed messages, and terminates within a bounded interval of time. The algorithm is resilient to transient faults and asynchrony in a fraction of links with known size per number of faulty processes, as it circumvents asynchronous and faulty links with 3-hop epidemic dissemination. Key finding: the resilience to asynchrony of links and the enabled by it leaderless consensus in partial synchrony ensure algorithm operation with simultaneous validity, safety, and bounded liveness.", "field": "cs", "label": 1}
{"text": "Title: Sandra -- A Neuro-Symbolic Reasoner Based On Descriptions And Situations\nAbstract: This paper presents sandra, a neuro-symbolic reasoner combining vectorial representations with deductive reasoning. Sandra builds a vector space constrained by an ontology and performs reasoning over it. The geometric nature of the reasoner allows its combination with neural networks, bridging the gap with symbolic knowledge representations. Sandra is based on the Description and Situation (DnS) ontology design pattern, a formalization of frame semantics. Given a set of facts (a situation) it allows to infer all possible perspectives (descriptions) that can provide a plausible interpretation for it, even in presence of incomplete information. We prove that our method is correct with respect to the DnS model. We experiment with two different tasks and their standard benchmarks, demonstrating that, without increasing complexity, sandra (i) outperforms all the baselines (ii) provides interpretability in the classification process, and (iii) allows control over the vector space, which is designed a priori.", "field": "cs", "label": 0}
{"text": "Title: Almost Difference Sets from Unions of Cyclotomic Classes of Order 14\nAbstract: Almost difference sets have emerged as a fascinating and important area of research as they can produce functions with optimal nonlinearity, cyclic codes, and binary sequences with optimal autocorrelation. This study aims to investigate the existence of almost difference sets from the union of suitable cyclotomic classes of order 14 (with and without the residue zero) of the finite field $GF(q)$, where $q$ is a prime of the form $q=14n+1$ for positive integers $n\\geq 1$ and $q<1000$. The construction utilized an exhaustive computer search using Python. The method computes the unions of two classes up to thirteen classes and tests the existence of almost difference sets. The equivalence of the generated almost difference sets with the same parameters is also determined. The findings will contribute to the literature with a new construction of almost difference sets via cyclotomy of order 14.", "field": "math", "label": 1}
{"text": "Title: Modeling and numerical simulation of fully Eulerian fluid-structure interaction using cut finite elements\nAbstract: We present a monolithic finite element formulation for (nonlinear) fluid-structure interaction in Eulerian coordinates. For the discretization we employ an unfitted finite element method based on inf-sup stable finite elements. So-called ghost penalty terms are used to guarantee the robustness of the approach independently of the way the interface cuts the finite element mesh. The resulting system is solved in a monolithic fashion using Newton's method. Our developments are tested on a numerical example with fixed interface.", "field": "math", "label": 1}
{"text": "Title: Pushing the Limits: Concurrency Detection in Acyclic, Live, and 1-Safe Free-Choice Nets in $O\\big((P + T)^2\\big)$\nAbstract: Concurrency is an important aspect of (Petri) nets to describe and simulate the behavior of complex systems. Knowing which places and transitions could be executed in parallel helps to understand nets and enables analysis techniques and the computation of other properties, such as causality, exclusivity, etc.. All techniques based on concurrency detection depend on the efficiency of this detection methodology. Kovalyov and Esparza have developed algorithms that compute all concurrent places in $O\\big((P+T)TP^2\\big)$ for live nets (where $P$ and $T$ are the numbers of places and transitions) and in $O\\big(P(P+T)^2\\big)$ for live free-choice nets. Although these algorithms have a reasonably good computational complexity, large numbers of concurrent pairs of nodes may still lead to long computation times. Furthermore, both algorithms cannot be parallelized without additional effort. This paper complements the palette of concurrency detection algorithms with the Concurrent Paths (CP) algorithm for safe, live, free-choice nets. The algorithm allows parallelization and has a worst-case computational complexity of $O\\big((P+T)^2\\big)$ for acyclic nets and of $O\\big(P^3+PT^2\\big)$ for cyclic nets. Although the computational complexity of cyclic nets has not improved, the evaluation shows the benefits of CP, especially, if the net contains many nodes in concurrency relation.", "field": "cs", "label": 0}
{"text": "Title: Weakly subnormal subgroups and variations of the Baer-Suzuki theorem\nAbstract: A subgroup $R$ of a finite group $G$ is weakly subnormal in $G$ if $R$ is not subnormal in $G$ but it is subnormal in every proper overgroup of $R$ in $G$. In this paper, we first classify all finite groups $G$ which contains a weakly subnormal $p$-subgroup for some prime $p$. We then determine all finite groups containing a cyclic weakly subnormal $p$-subgroup. As applications, we prove a number of variations of the Baer-Suzuki theorem using the orders of certain group elements.", "field": "math", "label": 1}
{"text": "Title: An Efficient, High-Rate Scheme for Private Information Retrieval over the Gaussian MAC\nAbstract: This paper addresses the challenge of the private information retrieval (PIR) problem wherein there are $N$ replicated non-communicating databases containing the same $M$ messages and a user who wants to retrieve one of the messages without revealing the wanted message's index to the databases. In addition, we assume a block-fading additive white Gaussian noise multiple access channel (AWGN MAC) linking the user and the databases. Shmuel's contribution \\cite{shmuel2021private}, presenting a joint channel-PIR scheme utilizing the C\\&F protocol, has shown the potential of a joint channel-PIR scheme over a separated scheme. In this paper, we propose an improved joint channel-PIR approach tailored for the PIR problem with $N$ databases over a block-fading AWGN. Unlike the C\\&F protocol, our scheme offers reduced computational complexity while improving the scaling laws governing the achievable rate. Our achievable rate scales with the number of databases $N$ and the power $P$ similarly to the channel capacity without the privacy constraint and outperforms the C\\&F-based approach. Furthermore, our analysis demonstrates that our improved rate exhibits only a finite gap from the channel capacity of one bit as $N$ increases.", "field": "cs", "label": 1}
{"text": "Title: The Power of Populations in Decentralized Bandits\nAbstract: We study a cooperative multi-agent bandit setting in the distributed GOSSIP model: in every round, each of $n$ agents chooses an action from a common set, observes the action's corresponding reward, and subsequently exchanges information with a single randomly chosen neighbor, which informs its policy in the next round. We introduce and analyze several families of fully-decentralized local algorithms in this setting under the constraint that each agent has only constant memory. We highlight a connection between the global evolution of such decentralized algorithms and a new class of \"zero-sum\" multiplicative weights update methods, and we develop a general framework for analyzing the population-level regret of these natural protocols. Using this framework, we derive sublinear regret bounds for both stationary and adversarial reward settings. Moreover, we show that these simple local algorithms can approximately optimize convex functions over the simplex, assuming that the reward distributions are generated from a stochastic gradient oracle.", "field": "cs", "label": 0}
{"text": "Title: Maximal planar graphs that embed as centers\nAbstract: A maximal planar graph is a graph which can be embedded in the plane such that every face of the graph is a triangle. The center of a graph is the subgraph induced by the vertices of minimum eccentricity. We introduce the notion of quasi-eccentric vertices, and use this to characterize maximal planar graphs that are the center of some planar graph. We also present some easier to check only necessary / only sufficient conditions for planar and maximal planar graphs to be the center of a planar graph. Finally, we use the aforementioned characterization to prove that all maximal planar graphs of order at most 8 are the center of some planar graph -- and this bound is sharp.", "field": "math", "label": 1}
{"text": "Title: Probability that $n$ points are in convex position in a regular $κ$-gon : Asymptotic results\nAbstract: Let $\\mathbb{P}_{\\kappa}(n)$ be the probability that $n$ points $z_1,\\ldots,z_n$ picked uniformly and independently in $\\mathfrak{C}_\\kappa$, a regular $\\kappa$-gon with area $1$, are in convex position, that is, form the vertex set of a convex polygon. In this paper, we give an equivalent of $\\mathbb{P}_{\\kappa}(n)$ for all $\\kappa\\geq 3$, which improves on a famous result of B\\'ar\\'any. A second aim of the paper is to establish a limit theorem which describes the fluctuations around the limit shape of a $n$-tuple of points in convex position when $n\\to+\\infty$. Finally, we give an algorithm asymptotically exact for the random generation of $z_1,\\ldots,z_n$, conditioned to be in convex position in $\\mathfrak{C}_\\kappa$.", "field": "math", "label": 1}
{"text": "Title: The equidistribution of Elliptic Dedekind sums and generalized Selberg-Kloosterman sums\nAbstract: We show that the values of elliptic Dedekind sums, after normalization, are equidistributed mod 1. The key ingredient is a non-trivial bound on generalized Selberg-Kloosterman sums for discrete subgroups of $\\PSL_2(\\mathbb C)$ using Poincar\\'e series.", "field": "math", "label": 1}
{"text": "Title: Billiards, Checkers, and Quadratic Reciprocity\nAbstract: We indulge in what mathematicians call frivolous activities. In Arithmetic Billiards, a ball is bouncing around in a rectangle. In Parity Checkers we place checkers on a checkerboard under certain parity constraints. Both activities turn out to capture the division of congruence classes modulo a prime into squares and non-squares, allowing fairly simple proofs of the celebrated Law of Quadratic Reciprocity. Since the activities are analyzed somewhat in parallel we don't obtain two independent proofs. But Franz Lemmermeyer's online list of reciprocity proofs already contains well over three hundred items, which seems enough anyway.", "field": "math", "label": 0}
{"text": "Title: Masked Conditional Diffusion Model for Enhancing Deepfake Detection\nAbstract: Recent studies on deepfake detection have achieved promising results when training and testing faces are from the same dataset. However, their results severely degrade when confronted with forged samples that the model has not yet seen during training. In this paper, deepfake data to help detect deepfakes. this paper present we put a new insight into diffusion model-based data augmentation, and propose a Masked Conditional Diffusion Model (MCDM) for enhancing deepfake detection. It generates a variety of forged faces from a masked pristine one, encouraging the deepfake detection model to learn generic and robust representations without overfitting to special artifacts. Extensive experiments demonstrate that forgery images generated with our method are of high quality and helpful to improve the performance of deepfake detection models.", "field": "cs", "label": 0}
{"text": "Title: Interpretable Concept Bottlenecks to Align Reinforcement Learning Agents\nAbstract: Goal misalignment, reward sparsity and difficult credit assignment are only a few of the many issues that make it difficult for deep reinforcement learning (RL) agents to learn optimal policies. Unfortunately, the black-box nature of deep neural networks impedes the inclusion of domain experts for inspecting the model and revising suboptimal policies. To this end, we introduce *Successive Concept Bottleneck Agents* (SCoBots), that integrate consecutive concept bottleneck (CB) layers. In contrast to current CB models, SCoBots do not just represent concepts as properties of individual objects, but also as relations between objects which is crucial for many RL tasks. Our experimental results provide evidence of SCoBots' competitive performances, but also of their potential for domain experts to understand and regularize their behavior. Among other things, SCoBots enabled us to identify a previously unknown misalignment problem in the iconic video game, Pong, and resolve it. Overall, SCoBots thus result in more human-aligned RL agents. Our code is available at https://github.com/k4ntz/SCoBots .", "field": "cs", "label": 1}
{"text": "Title: Early Time Classification with Accumulated Accuracy Gap Control\nAbstract: Early time classification algorithms aim to label a stream of features without processing the full input stream, while maintaining accuracy comparable to that achieved by applying the classifier to the entire input. In this paper, we introduce a statistical framework that can be applied to any sequential classifier, formulating a calibrated stopping rule. This data-driven rule attains finite-sample, distribution-free control of the accuracy gap between full and early-time classification. We start by presenting a novel method that builds on the Learn-then-Test calibration framework to control this gap marginally, on average over i.i.d. instances. As this algorithm tends to yield an excessively high accuracy gap for early halt times, our main contribution is the proposal of a framework that controls a stronger notion of error, where the accuracy gap is controlled conditionally on the accumulated halt times. Numerical experiments demonstrate the effectiveness, applicability, and usefulness of our method. We show that our proposed early stopping mechanism reduces up to 94% of timesteps used for classification while achieving rigorous accuracy gap control.", "field": "cs", "label": 1}
{"text": "Title: A note on the quantum Berezinian for the double Yangian of the Lie superalgebra $\\mathfrak{gl}_{m|n}$\nAbstract: In this note, we generalize the notion of quantum Berezinian to the double Yangian ${\\rm DY}(\\mathfrak{gl}_{m|n})$ of the Lie superalgebra $\\mathfrak{gl}_{m|n}$. We show that its coefficients form a family of algebraically independent topological generators of the center of ${\\rm DY}(\\mathfrak{gl}_{m|n})$.", "field": "math", "label": 0}
{"text": "Title: Constructing rotatable permutations of $\\mathbb{F}_{2^m}^3$ with $3$-homogeneous functions\nAbstract: In the literature, there are many results about permutation polynomials over finite fields. However, very few permutations of vector spaces are constructed although it has been shown that permutations of vector spaces have many applications in cryptography, especially in constructing permutations with low differential and boomerang uniformities. In this paper, motivated by the butterfly structure \\cite{perrin2016cryptanalysis} and the work of Qu and Li \\cite{qu2023}, we investigate rotatable permutations from $\\gf_{2^m}^3$ to itself with $d$-homogenous functions. Based on the theory of equations of low degree, the resultant of polynomials, and some skills of exponential sums, we construct five infinite classes of $3$-homogeneous rotatable permutations from $\\gf_{2^m}^3$ to itself, where $m$ is odd. Moreover, we demonstrate that the corresponding permutation polynomials of $\\gf_{2^{3m}}$ of our newly constructed permutations of $\\gf_{2^m}^3$ are QM-inequivalent to the known ones.", "field": "math", "label": 0}
{"text": "Title: On Euler's totient function of polynomials over finite fields\nAbstract: In this paper, we study some typical arithmetic properties of Euler's totient function of polynomials over finite fields. Especially, we study polynomial analogues of some classical conjectures about Euler's totient function, such as Carmichael's conjecture, Sierpi\\'{n}ski's conjecture, and Erd\\\"{o}s' conjecture.", "field": "math", "label": 0}
{"text": "Title: An equivalent inequality for the Riemann hypothesis\nAbstract: We present a purely analytical inequality which is equivalent to the Riemann hypothesis (RH). The proof of the equivalence is based on a representation of the modulus of the Riemann xi-function. As the first step to analyze the inequality, we consider polynomial approximations. We also show that the RH is equivalent to the statement that some wave functions constructed using the Brownian motion never evolve into perfectly distinguishable states.", "field": "math", "label": 0}
{"text": "Title: Orthogonal gamma-based expansion for the CIR's first passage time distribution\nAbstract: In this paper we analyze a method for approximating the first-passage time density and the corresponding distribution function for a CIR process. This approximation is obtained by truncating a series expansion involving the generalized Laguerre polynomials and the gamma probability density. The suggested approach involves a number of numerical issues which depend strongly on the coefficient of variation of the first passage time random variable. These issues are examined and solutions are proposed also involving the first passage time distribution function. Numerical results and comparisons with alternative approximation methods show the strengths and weaknesses of the proposed method. A general acceptance-rejection-like procedure, that makes use of the approximation, is presented. It allows the generation of first passage time data, even if its distribution is unknown.", "field": "math", "label": 0}
{"text": "Title: Mixed Static and Reconfigurable Metasurface Deployment in Indoor Dense Spaces: How Much Reconfigurability is Needed?\nAbstract: In this paper, we investigate how metasurfaces can be deployed to deliver high data rates in a millimeter-wave (mmWave) indoor dense space with many blocking objects. These surfaces can either be static metasurfaces (SMSs) that reflect with fixed phase-shifts or reconfigurable intelligent surfaces (RISs) that can reconfigure their phase-shifts to the currently served user. The latter comes with an increased power, cabling, and signaling cost. To see how reconfigurability affects the network performance, we propose an iterative algorithm based on the feasible point pursuit successive convex approximation method. We jointly optimize the types and phase-shifts of the surfaces and the time portion allocated to each user equipment to maximize the minimum data rate achieved by the network. Our numerical results demonstrate that the minimum data rate improves as more RISs are introduced but the gain diminishes after some point. Therefore, introducing more reconfigurability is not always necessary. Another result shows that to reach the same data rate achieved by using 22 SMSs, at least 18 RISs are needed. This suggests that when it is costly to deploy many RISs, as an inexpensive alternative solution, one can reach the same data rate just by densely deploying more SMSs.", "field": "cs", "label": 0}
{"text": "Title: Korevaar-Schoen spaces on Sierpiński carpets\nAbstract: We prove that certain $L^p$-regularity functional inequality holds on \\emph{generalized Sierpi\\'nski carpets}. This gives an affirmative answer to an open question raised by Fabrice Baudoin. Our technique originates from an old idea of Alf Jonsson in 1996.", "field": "math", "label": 1}
{"text": "Title: Longtime dynamics for the Landau Hamiltonian with a time dependent magnetic field\nAbstract: We consider a modulated magnetic field, $B(t) = B_0 +\\varepsilon f(\\omega t)$, perpendicular to a fixed plane, where $B_0$ is constant, $\\varepsilon>0$ and $f$ a periodic function on the torus ${\\mathbb T}^n$. Our aim is to study classical and quantum dynamics for the corresponding Landau Hamiltonian. It turns out that the results depend strongly on the chosen gauge. For the Landau gauge the position observable is unbounded for \"almost all\" non resonant frequencies $\\omega$. On the contrary, for the symmetric gauge we obtain that, for \"almost all\" non resonant frequencies $\\omega$, the Landau Hamiltonian is reducible to a two dimensional harmonic oscillator and thus gives rise to bounded dynamics. The proofs use KAM algorithms for the classical dynamics. Quantum applications are given. In particular, the Floquet spectrum is absolutely continuous in the Landau gauge while it is discrete, of finite multiplicity, in symmetric gauge.", "field": "math", "label": 0}
{"text": "Title: A Joint Communication and Computation Framework for Digital Twin over Wireless Networks\nAbstract: In this paper, the problem of low-latency communication and computation resource allocation for digital twin (DT) over wireless networks is investigated. In the considered model, multiple physical devices in the physical network (PN) needs to frequently offload the computation task related data to the digital network twin (DNT), which is generated and controlled by the central server. Due to limited energy budget of the physical devices, both computation accuracy and wireless transmission power must be considered during the DT procedure. This joint communication and computation problem is formulated as an optimization problem whose goal is to minimize the overall transmission delay of the system under total PN energy and DNT model accuracy constraints. To solve this problem, an alternating algorithm with iteratively solving device scheduling, power control, and data offloading subproblems. For the device scheduling subproblem, the optimal solution is obtained in closed form through the dual method. For the special case with one physical device, the optimal number of transmission times is reveled. Based on the theoretical findings, the original problem is transformed into a simplified problem and the optimal device scheduling can be found. Numerical results verify that the proposed algorithm can reduce the transmission delay of the system by up to 51.2\\% compared to the conventional schemes.", "field": "cs", "label": 0}
{"text": "Title: Intent Assurance using LLMs guided by Intent Drift\nAbstract: Intent-Based Networking (IBN) presents a paradigm shift for network management, by promising to align intents and business objectives with network operations--in an automated manner. However, its practical realization is challenging: 1) processing intents, i.e., translate, decompose and identify the logic to fulfill the intent, and 2) intent conformance, that is, considering dynamic networks, the logic should be adequately adapted to assure intents. To address the latter, intent assurance is tasked with continuous verification and validation, including taking the necessary actions to align the operational and target states. In this paper, we define an assurance framework that allows us to detect and act when intent drift occurs. To do so, we leverage AI-driven policies, generated by Large Language Models (LLMs) which can quickly learn the necessary in-context requirements, and assist with the fulfillment and assurance of intents.", "field": "cs", "label": 1}
{"text": "Title: Lattice paths and the Rogers--Ramanujan--Gordon type theorems with parity considerations\nAbstract: Andrews imposed parity restrictions on the Rogers-Ramanujan-Gordon type partitions, yielding fruitful results. These results were later, advanced by Kur\\c{s}ung\\\"{o}z, Kim, and Yee. In this paper, we construct a bijection between lattice paths with three kinds of unitary steps and the Rogers--Ramanujan--Gordon type partitions. We give some results involving parity considerations on lattice paths by this bijection which are Andrews' partition results counterpart. We also give some new results on lattice paths.", "field": "math", "label": 1}
{"text": "Title: Balancing the AI Strength of Roles in Self-Play Training with Regret Matching+\nAbstract: When training artificial intelligence for games encompassing multiple roles, the development of a generalized model capable of controlling any character within the game presents a viable option. This strategy not only conserves computational resources and time during the training phase but also reduces resource requirements during deployment. training such a generalized model often encounters challenges related to uneven capabilities when controlling different roles. A simple method is introduced based on Regret Matching+, which facilitates a more balanced performance of strength by the model when controlling various roles.", "field": "cs", "label": 1}
{"text": "Title: Position Paper: Bayesian Deep Learning in the Age of Large-Scale AI\nAbstract: In the current landscape of deep learning research, there is a predominant emphasis on achieving high predictive accuracy in supervised tasks involving large image and language datasets. However, a broader perspective reveals a multitude of overlooked metrics, tasks, and data types, such as uncertainty, active and continual learning, and scientific data, that demand attention. Bayesian deep learning (BDL) constitutes a promising avenue, offering advantages across these diverse settings. This paper posits that BDL can elevate the capabilities of deep learning. It revisits the strengths of BDL, acknowledges existing challenges, and highlights some exciting research avenues aimed at addressing these obstacles. Looking ahead, the discussion focuses on possible ways to combine large-scale foundation models with BDL to unlock their full potential.", "field": "cs", "label": 0}
{"text": "Title: New results on egalitarian values for games with a priori unions\nAbstract: Several extensions of the equal division value and the equal surplus division value to the family of games with a priori unions are proposed in Alonso-Meijide et al. (2020) ``On egalitarian values for cooperative games with a priori unions.'' TOP 28: 672-688. In this paper we provide new axiomatic characterizations of these values. Furthermore, using the equal surplus division value in two steps, we propose a new coalitional value. The balanced contributions and quotient game properties give rise to a different modification of the equal surplus division value.", "field": "cs", "label": 1}
{"text": "Title: One-sided discretization inequalities and sampling recovery\nAbstract: Recently, in a number of papers it was understood that results on sampling discretization and on the universal sampling discretization can be successfully used in the problem of sampling recovery. Moreover, it turns out that it is sufficient to only have a one-sided discretization inequality for some of those applications. This motivates us to write the present paper as a survey/research paper with the focus on the one-sided discretization inequalities and their applications in the sampling recovery. In this sense the paper complements the two existing survey papers on sampling discretization.", "field": "math", "label": 1}
{"text": "Title: Conformal invariants of curves via those for inscribed polygons with circular edges\nAbstract: The conformal nature of smooth curves in $\\mathbb{R}^3$ is characterised by conformal length, curvature and torsion. We present a derivation of these conformal parameters via a limiting process using inscribed polygons with circular edges . The procedure is based on elementary geometry in $\\mathbb{R}^3$ only and similar to the rectification of curves in the metrical case. It seems to be not available in the literature so far.", "field": "math", "label": 1}
{"text": "Title: Machine learning for sports betting: should model selection be based on accuracy or calibration?\nAbstract: Sports betting's recent federal legalisation in the USA coincides with the golden age of machine learning. If bettors can leverage data to reliably predict the probability of an outcome, they can recognise when the bookmaker's odds are in their favour. As sports betting is a multi-billion dollar industry in the USA alone, identifying such opportunities could be extremely lucrative. Many researchers have applied machine learning to the sports outcome prediction problem, generally using accuracy to evaluate the performance of predictive models. We hypothesise that for the sports betting problem, model calibration is more important than accuracy. To test this hypothesis, we train models on NBA data over several seasons and run betting experiments on a single season, using published odds. We show that using calibration, rather than accuracy, as the basis for model selection leads to greater returns, on average (return on investment of $+34.69\\%$ versus $-35.17\\%$) and in the best case ($+36.93\\%$ versus $+5.56\\%$). These findings suggest that for sports betting (or any probabilistic decision-making problem), calibration is a more important metric than accuracy. Sports bettors who wish to increase profits should therefore select their predictive model based on calibration, rather than accuracy.", "field": "cs", "label": 0}
{"text": "Title: A homomorphism from the affine Yangian $Y_{\\hbar,\\varepsilon}(\\widehat{\\mathfrak{sl}}(n))$ to the affine Yangian $Y_{\\hbar,\\varepsilon}(\\widehat{\\mathfrak{sl}}(n+1))$\nAbstract: We construct a homomorphism from the affine Yangian $Y_{\\hbar,\\varepsilon}(\\widehat{\\mathfrak{sl}}(n))$ to the affine Yangian $Y_{\\hbar,\\varepsilon}(\\widehat{\\mathfrak{sl}}(n+1))$. We also give the relationship between this homomorphism and the one from the affine Yangian $Y_{\\hbar,\\varepsilon}(\\widehat{\\mathfrak{sl}}(n))$ to the universal enveloping algebra of the rectangular algebra $\\mathcal{W}^k(\\mathfrak{gl}(2n),(2^n))$ constructed by the author.", "field": "math", "label": 0}
{"text": "Title: Classification-Oriented Semantic Wireless Communications\nAbstract: We propose semantic communication over wireless channels for various modalities, e.g., text and images, in a task-oriented communications setup where the task is classification. We present two approaches based on memory and learning. Both approaches rely on a pre-trained neural network to extract semantic information but differ in codebook construction. In the memory-based approach, we use semantic quantization and compression models, leveraging past source realizations as a codebook to eliminate the need for further training. In the learning-based approach, we use a semantic vector quantized autoencoder model that learns a codebook from scratch. Both are followed by a channel coder in order to reliably convey semantic information to the receiver (classifier) through the wireless medium. In addition to classification accuracy, we define system time efficiency as a new performance metric. Our results demonstrate that the proposed memory-based approach outperforms its learning-based counterpart with respect to system time efficiency while offering comparable accuracy to semantic agnostic conventional baselines.", "field": "cs", "label": 1}
{"text": "Title: On the existence and uniqueness of unbounded solutions to quadratic BSDEs with convex generators\nAbstract: With the terminal value $\\xi^-$ admitting some given exponential moment and $\\xi^+$ admitting every exponential moments or being bounded, we present several existence and uniqueness results for the unbounded solutions of quadratic backward stochastic differential equations whose generator $g$ may be non-Lipschitz with general growth in the first unknown variable $y$, and is convex (concave) in the second unknown variable $z$. This generalizes some results reported in [4] by relaxing the continuity and growth condition of $g$ in $y$. We also establish the corresponding comparison theorems for the unbounded solutions of the preceding BSDEs. These results are proved by those existing ideas and some innovative ones.", "field": "math", "label": 1}
{"text": "Title: Explicit Good Codes Approaching Distance 1 in Ulam Metric\nAbstract: The Ulam distance of two permutations on $[n]$ is $n$ minus the length of their longest common subsequence. In this paper, we show that for every $\\varepsilon>0$, there exists some $\\alpha>0$, and an infinite set $\\Gamma\\subseteq \\mathbb{N}$, such that for all $n\\in\\Gamma$, there is an explicit set $C_n$ of $(n!)^{\\alpha}$ many permutations on $[n]$, such that every pair of permutations in $C_n$ has pairwise Ulam distance at least $(1-\\varepsilon)\\cdot n$. Moreover, we can compute the $i^{\\text{th}}$ permutation in $C_n$ in poly$(n)$ time and can also decode in poly$(n)$ time, a permutation $\\pi$ on $[n]$ to its closest permutation $\\pi^*$ in $C_n$, if the Ulam distance of $\\pi$ and $\\pi^*$ is less than $ \\frac{(1-\\varepsilon)\\cdot n}{4} $. Previously, it was implicitly known by combining works of Goldreich and Wigderson [Israel Journal of Mathematics'23] and Farnoud, Skachek, and Milenkovic [IEEE Transactions on Information Theory'13] in a black-box manner, that it is possible to explicitly construct $(n!)^{\\Omega(1)}$ many permutations on $[n]$, such that every pair of them have pairwise Ulam distance at least $\\frac{n}{6}\\cdot (1-\\varepsilon)$, for any $\\varepsilon>0$, and the bound on the distance can be improved to $\\frac{n}{4}\\cdot (1-\\varepsilon)$ if the construction of Goldreich and Wigderson is directly analyzed in the Ulam metric.", "field": "cs", "label": 1}
{"text": "Title: On a conjecture of Stolz in the toric case\nAbstract: In 1996 Stolz conjectured that a string manifold with positive Ricci curvature has vanishing Witten genus. Here we prove this conjecture for toric string Fano manifolds and for string torus manifolds admitting invariant metrics of non-negative sectional curvature.", "field": "math", "label": 0}
{"text": "Title: The Hilden Double Coset Problem in Braid Groups\nAbstract: In this paper we provide a solution to the double coset problem for the braid group $B_n$ modulo the Hilden subgroup $H_n.$ This result demonstrates that, as in the case of braid closures, the Link Problem for plat closures is \"stably equivalent\" to a solvable algebraic problem. A particularly interesting feature of the proof is that, like Garside's solutions to the Word and Conjugacy Problems, it too relies on Garside's decomposition of braids in $B_n.$", "field": "math", "label": 0}
{"text": "Title: Multiplicity results for mass constrained Allen-Cahn equations on Riemannian manifolds with boundary\nAbstract: We present multiplicity results for mass constrained Allen-Cahn equations on a Riemannian manifold with boundary, considering both Neumann and Dirichlet conditions. These results hold under the assumptions of small mass constraint and small diffusion parameter. We obtain lower bounds on the number of solutions according to the Lusternik--Schnirelmann category of the manifold in case of Dirichlet boundary conditions and of its boundary in the case of Neumann boundary conditions. Under generic non-degeneracy assumptions on the solutions, we obtain stronger results based on Morse inequalities. Our approach combines topological and variational methods with tools from Geometric Measure Theory.", "field": "math", "label": 0}
{"text": "Title: Loop soup representation of zeta-regularised determinants and equivariant Symanzik identities\nAbstract: We derive a stochastic representation for determinants of Laplace-type operators on vectors bundles over manifolds. Namely, inverse powers of those determinants are written as the expectation of a product of holonomies defined over Brownian loop soups. Our results hold over compact manifolds of dimension 2 or 3, in the presence of mass or a boundary. We derive a few consequences, including some regularity as a function of the operator and the conformal invariance of the zeta function on surfaces. Our second main result is the rigorous construction of a stochastic gauge theory minimally coupling a scalar field to a prescribed random smooth gauge field, which we prove obeys the so-called Symanzik identities. Some of these results are continuous analogues of the work of A. Kassel and T. L\\'evy in the discrete.", "field": "math", "label": 0}
{"text": "Title: Single-Winner Voting with Alliances: Avoiding the Spoiler Effect\nAbstract: We study the setting of single-winner elections with ordinal preferences where candidates might be members of \\emph{alliances} (which may correspond to e.g., political parties, factions, or coalitions). However, we do not assume that candidates from the same alliance are necessarily adjacent in voters' rankings. In such case, every classical voting rule is vulnerable to the spoiler effect, i.e., the presence of a candidate may harm his or her alliance. We therefore introduce a new idea of \\emph{alliance-aware} voting rules which extend the classical ones. We show that our approach is superior both to using classical cloneproof voting rules and to running primaries within alliances before the election. We introduce several alliance-aware voting rules and show that they satisfy the most desirable standard properties of their classical counterparts as well as newly introduced axioms for the model with alliances which, e.g., exclude the possibility of the spoiler effect. Our rules have natural definitions and are simple enough to explain to be used in practice.", "field": "cs", "label": 0}
{"text": "Title: Ljusternik-Schnirelmann eigenvalues for the fractional $m-$Laplacian without the $Δ_2$ condition\nAbstract: In this work we analyze the eigenvalue problem associated to the fractional $m-$Laplacian, defined as $$ (-\\Delta_m)^s u(x):=2\\text{p.v.}\\int_{{\\mathbb R}^n} m\\left(\\frac{|u(x)-u(y)|}{|x-y|^s}\\right)\\frac{(u(x)-u(y))}{|u(x)-u(y)|}\\frac{dy}{|x-y|^{n+s}}, $$ This operator serves as a model for nonlocal, nonstandard growth diffusion problems. In contrast to previous analyses, we explore the eigenvalue problem without presuming the $\\Delta_2$ condition on $M$ -- the primitive function of $m$. Our results show the existence of a sequence of eigenvalues $\\lambda_k\\to\\infty$. This research contributes to advancing our understanding of nonlocal diffusion models, specifically those characterized by the fractional $m-$Laplacian, by relaxing the constraints imposed by the $\\Delta_2$ condition.", "field": "math", "label": 1}
{"text": "Title: The global well-posedness and Newtonian limit for the relativistic Boltzmann equation in a periodic box\nAbstract: In this paper, we study the Newtonian limit for relativistic Boltzmann equation in a periodic box $\\mathbb{T}^3$. We first establish the global-in-time mild solutions of relativistic Boltzmann equation with uniform-in-$\\mathfrak{c}$ estimates and time decay rate. Then we rigorously justify the global-in-time Newtonian limits from the relativistic Boltzmann solutions to the solution of Newtonian Boltzmann equation in $L^1_pL^{\\infty}_x$. Moreover, if the initial data of Newtonian Boltzmann equation belong to $W^{1,\\infty}(\\mathbb{T}^3\\times\\mathbb{R}^3)$, based on a decomposition and $L^2-L^\\infty$ argument, the global-in-time Newtonian limit is proved in $L^{\\infty}_{x,p}$. The convergence rates of Newtonian limit are obtained both in $L^1_pL^{\\infty}_x$ and $L^{\\infty}_{x,p}$.", "field": "math", "label": 1}
{"text": "Title: Parrot Captions Teach CLIP to Spot Text\nAbstract: Despite CLIP being the foundation model in numerous vision-language applications, the CLIP suffers from a severe text spotting bias. Such bias causes CLIP models to `Parrot' the visual text embedded within images while disregarding the authentic visual semantics. We uncover that in the most popular image-text dataset LAION-2B, the captions also densely parrot (spell) the text embedded in images. Our analysis shows that around 50% of images are embedded with visual text content, and around 30% of captions words are in these embedded visual content. Based on such observation, we thoroughly inspect the different released versions of CLIP models and verify that the visual text is the dominant factor in measuring the LAION-style image-text similarity for these models. To examine whether these parrot captions shape the text spotting bias, we train a series of CLIP models with LAION subsets curated by different parrot-caption-oriented criteria. We show that training with parrot captions easily shapes such bias but harms the expected visual-language representation learning in CLIP models. This suggests that it is urgent to revisit either the design of CLIP-like models or the existing image-text dataset curation pipeline built on CLIP score filtering.", "field": "cs", "label": 0}
{"text": "Title: Categorical Proof-Theoretic Semantics\nAbstract: In proof-theoretic semantics, model-theoretic validity is replaced by proof-theoretic validity. Validity of formulae is defined inductively from a base giving the validity of atoms using inductive clauses derived from proof-theoretic rules. A key aim is to show completeness of the proof rules without any requirement for formal models. Establishing this for propositional intuitionistic logic (IPL) raises some technical and conceptual issues. We relate Sandqvist's (complete) base-extension semantics of intuitionistic propositional logic to categorical proof theory in presheaves, reconstructing categorically the soundness and completeness arguments, thereby demonstrating the naturality of Sandqvist's constructions. This naturality includes Sandqvist's treatment of disjunction that is based on its second-order or elimination-rule presentation. These constructions embody not just validity, but certain forms of objects of justifications. This analysis is taken a step further by showing that from the perspective of validity, Sandqvist's semantics can also be viewed as the natural disjunction in a category of sheaves.", "field": "math", "label": 0}
